Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
// ═══════════════════════════════════════════════════════════════════════════
// WontHound-CYD Main Firmware
// ESP32 Cheap Yellow Display Edition
// v3.5.1 — Fix CYD35C pin mapping: CC1101_CS=26, NRF24_CSN=21 (issue #5)
// Created: 2026-02-06
// ═══════════════════════════════════════════════════════════════════════════
//
// Hardware:
//   - CYD ESP32-2432S028 (2.8") or ESP32-3248S035 (3.5")
//   - CC1101 SubGHz Radio (Optional - shows stub if not available)
//   - NRF24L01+PA+LNA 2.4GHz Radio (Optional - shows stub if not available)
//   - LiPo Battery + USB-C Boost Converter
//
// Based on ESP32-DIV WontHound Edition by Jesse (JesseCHale)
// GitHub: github.com/wontfallo
//
// ═══════════════════════════════════════════════════════════════════════════

#include <SPI.h>
#include <TFT_eSPI.h>
#include <WiFi.h>
#include <BLEDevice.h>
#include <esp_heap_caps.h>
#include "storage.h"

// WontHound-CYD modules
#include "cyd_config.h"
#include "shared.h"
#include "utils.h"
#include "touch_buttons.h"
#include "wifi_band_utils.h"
#include "spi_manager.h"
#include "subconfig.h"
#include "nrf24_config.h"
#include "icon.h"
#include "skull_bg.h"
#include "wonthound_bg.h"   // 240x320 RGB565 home-screen background (Anonymous bulb)
#include "wonthound_icons.h" // 10 color menu tile icons (100x100 RGB565)

// Attack modules
#include "wifi_attacks.h"
#include "bluetooth_attacks.h"
#include "subghz_attacks.h"
#include "nrf24_attacks.h"
#include "gps_module.h"
#include "serial_monitor.h"
#include "firmware_update.h"
#include "wardriving_screen.h"
#include "eapol_capture.h"
#include "karma_attack.h"
#include "saved_captures.h"
#include "radio_test.h"
#include "iot_recon.h"
#include "loot_manager.h"
#include "rfid_attacks.h"
#include "jam_detect.h"
#include "s3_audio.h"
#if __has_include("battery_monitor.h")
  #include "battery_monitor.h"
#else
  // Stubs — battery monitor not present in this build
  static inline void batteryInit() {}
  static inline void batteryUpdate() {}
  static inline int  batteryGetPercent() { return -1; }
  static inline int  batteryGetVoltage() { return 0; }
  static inline bool batteryIsLow() { return false; }
  static inline bool batteryIsCritical() { return false; }
  static inline void drawBatteryIndicator(int x, int y) { (void)x; (void)y; }
#endif

// ═══════════════════════════════════════════════════════════════════════════
// GLOBAL OBJECTS
// ═══════════════════════════════════════════════════════════════════════════

TFT_eSPI tft = TFT_eSPI();

// (VALHALLA accent colors removed)

// Menu state - matches original ESP32-DIV
int current_menu_index = 0;
int current_submenu_index = 0;
int submenu_page = 0;            // current page of the paginated submenu
bool in_sub_menu = false;
bool feature_active = false;
bool submenu_initialized = false;
bool is_main_menu = false;
bool feature_exit_requested = false;

int last_menu_index = -1;
int last_submenu_index = -1;
bool menu_initialized = false;

// Home-screen scrollable app-grid state (redesign — canvas taller than screen)
int menu_scroll_y = 0;     // current vertical scroll offset (px)
int menu_max_scroll = 0;   // computed from item count vs visible window

unsigned long last_interaction_time = 0;

// ═══════════════════════════════════════════════════════════════════════════
// MENU DEFINITIONS - EXACT MATCH TO ORIGINAL ESP32-DIV
// ═══════════════════════════════════════════════════════════════════════════

const int NUM_MENU_ITEMS = 10;
const char *menu_items[NUM_MENU_ITEMS] = {
    "WiFi",
    "Bluetooth",
    "2.4GHz",
    "SubGHz",
    "RFID",
    "Jam Detect",
    "SIGINT",
    "Tools",
    "Setting",
    "About"
};

const unsigned char *bitmap_icons[NUM_MENU_ITEMS] = {
    bitmap_icon_skull_wifi,
    bitmap_icon_skull_bluetooth,
    bitmap_icon_skull_jammer,
    bitmap_icon_skull_subghz,
    bitmap_icon_skull_rfid,
    bitmap_icon_skull_tools,
    bitmap_icon_skull_ir,
    bitmap_icon_skull_tools,
    bitmap_icon_skull_setting,
    bitmap_icon_skull_about
};

// WiFi Submenu - 9 items
const int NUM_SUBMENU_ITEMS = 9;
const char *submenu_items[NUM_SUBMENU_ITEMS] = {
    "Packet Monitor",
    "Beacon Spammer",
    "WiFi Deauther",
    "Probe Sniffer",
    "WiFi Scanner",
    "Captive Portal",
    "Station Scanner",
    "Auth Flood",
    "Back to Main Menu"
};

const unsigned char *wifi_submenu_icons[NUM_SUBMENU_ITEMS] = {
    bitmap_icon_wifi,
    bitmap_icon_antenna,
    bitmap_icon_wifi_jammer,
    bitmap_icon_skull_wifi,
    bitmap_icon_jammer,
    bitmap_icon_bash,
    bitmap_icon_graph,
    bitmap_icon_nuke,
    bitmap_icon_go_back
};

// Bluetooth Submenu - 8 items
const int bluetooth_NUM_SUBMENU_ITEMS = 7;
const char *bluetooth_submenu_items[bluetooth_NUM_SUBMENU_ITEMS] = {
    "BLE Jammer",
    "BLE Spoofer",
    "BLE Beacon",
    "BLE Predator",
    "WhisperPair",
    "Lunatic Fringe",
    "Back to Main Menu"
};

const unsigned char *bluetooth_submenu_icons[bluetooth_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_ble_jammer,
    bitmap_icon_spoofer,
    bitmap_icon_signal,
    bitmap_icon_analyzer,       // BLE Predator - analyzer icon
    bitmap_icon_eye,
    bitmap_icon_scanner,        // Lunatic Fringe (hub)
    bitmap_icon_go_back
};

// Lunatic Fringe Hub Submenu - 5 items (const * const → .rodata/flash, saves DRAM)
const int lunafringe_NUM_SUBMENU_ITEMS = 5;
static const char * const lunafringe_submenu_items_flash[] = {
    "Tracker Scan",
    "AirTag Detect",
    "Phantom Flood",
    "AirTag Replay",
    "Back"
};

static const unsigned char * const lunafringe_submenu_icons_flash[] = {
    bitmap_icon_scanner,
    bitmap_icon_apple,
    bitmap_icon_nuke,
    bitmap_icon_antenna,
    bitmap_icon_go_back
};

// NRF24 2.4GHz Submenu - 7 items
const int nrf_NUM_SUBMENU_ITEMS = 7;
const char *nrf_submenu_items[nrf_NUM_SUBMENU_ITEMS] = {
    "Scanner",
    "Spectrum Analyzer",
    "NRF Sniffer",
    "MouseJack",
    "WLAN Jammer",
    "Proto Kill",
    "Back to Main Menu"
};

const unsigned char *nrf_submenu_icons[nrf_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_scanner,
    bitmap_icon_analyzer,
    bitmap_icon_eye,            // NRF Sniffer - eye icon
    bitmap_icon_nuke,           // MouseJack - nuke icon
    bitmap_icon_wifi_jammer,
    bitmap_icon_skull_jammer,   // Proto Kill - skull jammer icon
    bitmap_icon_go_back
};

// SubGHz Submenu - 5 items
const int subghz_NUM_SUBMENU_ITEMS = 6;
const char *subghz_submenu_items[subghz_NUM_SUBMENU_ITEMS] = {
    "Replay Attack",
    "Brute Force",
    "SubGHz Jammer",
    "Spectrum Analyzer",
    "Saved Profile",
    "Back to Main Menu"
};

const unsigned char *subghz_submenu_icons[subghz_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_antenna,
    bitmap_icon_skull_subghz,
    bitmap_icon_no_signal,
    bitmap_icon_analyzer,
    bitmap_icon_list,
    bitmap_icon_go_back
};

// RFID Submenu - 6 items
const int rfid_NUM_SUBMENU_ITEMS = 6;
const char *rfid_submenu_items[rfid_NUM_SUBMENU_ITEMS] = {
    "Card Scanner",
    "Card Reader",
    "Card Clone",
    "Key Brute Force",
    "Card Emulate",
    "Back to Main Menu"
};

const unsigned char *rfid_submenu_icons[rfid_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_scanner,
    bitmap_icon_list,
    bitmap_icon_floppy,
    bitmap_icon_key,
    bitmap_icon_rfid,
    bitmap_icon_go_back
};

// Jam Detect Submenu - 5 items
const int jamdetect_NUM_SUBMENU_ITEMS = 5;
const char *jamdetect_submenu_items[jamdetect_NUM_SUBMENU_ITEMS] = {
    "WiFi Guardian",
    "SubGHz Sentinel",
    "2.4GHz Watchdog",
    "Full Spectrum",
    "Back to Main Menu"
};

const unsigned char *jamdetect_submenu_icons[jamdetect_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_skull_wifi,      // WiFi Guardian
    bitmap_icon_skull_subghz,    // SubGHz Sentinel
    bitmap_icon_skull_jammer,    // 2.4GHz Watchdog
    bitmap_icon_analyzer,        // Full Spectrum
    bitmap_icon_go_back
};

// SIGINT Submenu - 8 items
const int sigint_NUM_SUBMENU_ITEMS = 8;
const char *sigint_submenu_items[sigint_NUM_SUBMENU_ITEMS] = {
    "EAPOL Capture",
    "Karma Attack",
    "Wardriving",
    "Saved Captures",
    "IoT Recon",
    "Loot",
    "Flock You",
    "Back to Main Menu"
};

