Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
const unsigned char *sigint_submenu_icons[sigint_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_key,
    bitmap_icon_spoofer,
    bitmap_icon_follow,
    bitmap_icon_floppy2,
    bitmap_icon_scanner,
    bitmap_icon_floppy,
    bitmap_icon_scanner,
    bitmap_icon_go_back
};

// Tools Submenu
#if defined(ESP32S3_ES3C28P) && CYD_HAS_AUDIO
const int tools_NUM_SUBMENU_ITEMS = 7;
#else
const int tools_NUM_SUBMENU_ITEMS = 6;
#endif
const char *tools_submenu_items[tools_NUM_SUBMENU_ITEMS] = {
    "Serial Monitor",
    "Update Firmware",
    "Touch Calibrate",
    "GPS",
    "Radio Test",
#if defined(ESP32S3_ES3C28P) && CYD_HAS_AUDIO
    "S3 Audio",
#endif
    "Back to Main Menu"
};

const unsigned char *tools_submenu_icons[tools_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_bash,
    bitmap_icon_follow,
    bitmap_icon_stat,
    bitmap_icon_antenna,
    bitmap_icon_signal,
#if defined(ESP32S3_ES3C28P) && CYD_HAS_AUDIO
    bitmap_icon_bash,
#endif
    bitmap_icon_go_back
};

// Settings Submenu - 10 items
const int settings_NUM_SUBMENU_ITEMS = 10;
const char *settings_submenu_items[settings_NUM_SUBMENU_ITEMS] = {
    "Brightness",
    "Screen Timeout",
    "Swap Colors",
    "Invert Display",
    "Color Mode",
    "Rotation",
    "Device Info",
    "Set PIN",
    "CC1101 Module",
    "Back to Main Menu"
};

const unsigned char *settings_submenu_icons[settings_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_led,
    bitmap_icon_eye2,
    bitmap_icon_led,
    bitmap_icon_led,
    bitmap_icon_led,
    bitmap_icon_follow,
    bitmap_icon_stat,
    bitmap_icon_eye2,
    bitmap_icon_antenna,
    bitmap_icon_go_back
};

// About Submenu - 1 item
const int about_NUM_SUBMENU_ITEMS = 1;
const char *about_submenu_items[about_NUM_SUBMENU_ITEMS] = {
    "Back to Main Menu"
};

const unsigned char *about_submenu_icons[about_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_go_back
};

// Active submenu pointers
const char **active_submenu_items = nullptr;
int active_submenu_size = 0;
const unsigned char **active_submenu_icons = nullptr;

// Settings
int brightness_level = 255;
int screen_timeout_seconds = 60;

static void initBacklightPwm() {
    pinMode(CYD_TFT_BL, OUTPUT);
    digitalWrite(CYD_TFT_BL, HIGH);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcAttach(CYD_TFT_BL, 5000, 8);
#else
    ledcSetup(0, 5000, 8);
    ledcAttachPin(CYD_TFT_BL, 0);
#endif
}

static void setBacklightLevel(uint8_t level) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    ledcWrite(CYD_TFT_BL, level);
#else
    ledcWrite(0, level);
#endif
}
bool screen_asleep = false;
bool color_order_rgb = false;  // false = BGR (default), true = RGB (swapped panels)
#ifdef ESP32S3_ES3C28P
bool display_inverted = true;  // S3 IPS panel looks correct with inversion enabled
#else
bool display_inverted = false; // false = normal, true = inverted (for 2USB/inverted panels)
#endif
uint8_t color_mode = 0;       // 0 = Default, 1 = Colorblind, 2 = High Contrast
uint8_t screen_rotation = 0;  // 0 = Standard (USB down), 2 = Flipped 180 (USB up)

// PIN lock
uint16_t device_pin = 0;       // 4-digit PIN (0-9999), stored as number
bool pin_enabled = false;       // PIN lock feature on/off
bool device_locked = false;     // Current lock state (not persisted)

// Legacy disclaimer state; gates are disabled for this build.
bool disclaimer_accepted = true;

// C5 uses XPT2046 resistive touch, which REQUIRES calibration (unlike the S3's
// FT6336 capacitive panel). With no saved calibration the default mapping sends
// taps to the wrong buttons, so the user can't reach Tools > Touch Calibrate to
// fix it. Force the 4-corner calibration to run on first boot (saved to NVS,
// so it only runs once) just like every non-C5 board already does.
#ifndef C5_FORCE_TOUCH_CALIBRATION_ON_BOOT
#define C5_FORCE_TOUCH_CALIBRATION_ON_BOOT 1
#endif

// CC1101 PA Module — E07-433M20S support (TX_EN/RX_EN control)
bool cc1101_pa_module = false;      // E07 PA module active (persisted in EEPROM)

// Timeout option tables
const int timeoutOptions[] = {30, 60, 120, 300, 600, 0};
const char* timeoutLabels[] = {"30 SEC", "1 MIN", "2 MIN", "5 MIN", "10 MIN", "NEVER"};
const int numTimeoutOptions = 6;

// ═══════════════════════════════════════════════════════════════════════════
// MENU LAYOUT CONSTANTS - MATCHES ORIGINAL
// ═══════════════════════════════════════════════════════════════════════════

const int COLUMN_WIDTH = SCREEN_WIDTH / 2;
const int X_OFFSET_LEFT = 10;
const int X_OFFSET_RIGHT = X_OFFSET_LEFT + COLUMN_WIDTH;
const int Y_START = 30;
const int Y_SPACING = (SCREEN_HEIGHT - CONTENT_Y_START - BUTTON_BAR_H) / 5;

// ═══════════════════════════════════════════════════════════════════════════
// ICON BAR HELPER - MATCHES ORIGINAL WONTHOUND
// ═══════════════════════════════════════════════════════════════════════════

#define INO_ICON_SIZE 16

// Draw simple icon bar with back icon - MATCHES ORIGINAL WONTHOUND
void drawInoIconBar() {
    tft.drawLine(0, ICON_BAR_TOP, SCREEN_WIDTH, ICON_BAR_TOP, WONTHOUND_MAGENTA);
    tft.fillRect(0, ICON_BAR_Y, SCREEN_WIDTH, ICON_BAR_H, WONTHOUND_DARK);
    tft.drawBitmap(10, ICON_BAR_Y, bitmap_icon_go_back, INO_ICON_SIZE, INO_ICON_SIZE, WONTHOUND_MAGENTA);
    tft.drawLine(0, ICON_BAR_BOTTOM, SCREEN_WIDTH, ICON_BAR_BOTTOM, WONTHOUND_HOTPINK);
}

// Check if back icon was tapped. Use a finger-sized hitbox, not just the 16px icon.
bool isInoBackTapped() {
    if (isBackButtonTapped()) {
        delay(80);
        return true;
    }
    return false;
}

// ═══════════════════════════════════════════════════════════════════════════
// UPDATE ACTIVE SUBMENU
// ═══════════════════════════════════════════════════════════════════════════

void updateActiveSubmenu() {
    submenu_page = 0;   // fresh submenu always opens on the first page
    switch (current_menu_index) {
        case 0: // WiFi
            active_submenu_items = submenu_items;
            active_submenu_size = NUM_SUBMENU_ITEMS;
            active_submenu_icons = wifi_submenu_icons;
            break;
        case 1: // Bluetooth
            active_submenu_items = bluetooth_submenu_items;
            active_submenu_size = bluetooth_NUM_SUBMENU_ITEMS;
            active_submenu_icons = bluetooth_submenu_icons;
            break;
        case 2: // 2.4GHz (NRF)
            active_submenu_items = nrf_submenu_items;
            active_submenu_size = nrf_NUM_SUBMENU_ITEMS;
            active_submenu_icons = nrf_submenu_icons;
            break;
        case 3: // SubGHz
            active_submenu_items = subghz_submenu_items;
            active_submenu_size = subghz_NUM_SUBMENU_ITEMS;
            active_submenu_icons = subghz_submenu_icons;
            break;
        case 4: // RFID
            active_submenu_items = rfid_submenu_items;
            active_submenu_size = rfid_NUM_SUBMENU_ITEMS;
            active_submenu_icons = rfid_submenu_icons;
            break;
        case 5: // Jam Detect
            active_submenu_items = jamdetect_submenu_items;
            active_submenu_size = jamdetect_NUM_SUBMENU_ITEMS;
            active_submenu_icons = jamdetect_submenu_icons;
            break;
        case 6: // SIGINT
            active_submenu_items = sigint_submenu_items;
            active_submenu_size = sigint_NUM_SUBMENU_ITEMS;
            active_submenu_icons = sigint_submenu_icons;
            break;
        case 7: // Tools
            active_submenu_items = tools_submenu_items;
            active_submenu_size = tools_NUM_SUBMENU_ITEMS;
            active_submenu_icons = tools_submenu_icons;
            break;
        case 8: // Settings
            active_submenu_items = settings_submenu_items;
            active_submenu_size = settings_NUM_SUBMENU_ITEMS;
            active_submenu_icons = settings_submenu_icons;
            break;
        case 9: // About
            active_submenu_items = about_submenu_items;
            active_submenu_size = about_NUM_SUBMENU_ITEMS;
            active_submenu_icons = about_submenu_icons;
            break;
        default:
            active_submenu_items = nullptr;
            active_submenu_size = 0;
            active_submenu_icons = nullptr;
            break;
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// DISPLAY SUBMENU - MATCHES ORIGINAL STYLE
// ═══════════════════════════════════════════════════════════════════════════

// ── Paginated submenu layout: big, well-spaced touch buttons ────────────────
// Buttons are ~2x the old height and spaced out, so only a few fit per screen.
// When a submenu has more items than fit, it paginates with PREV/NEXT controls.
#define SUBMENU_PAGE_TOP   SCALE_Y(34)                    // Y of the first button
#define SUBMENU_BTN_H      SCALE_Y(46)                    // button height (~2x old 24px)
#define SUBMENU_ROW_SP     SCALE_Y(58)                    // row pitch (button + gap)
#define SUBMENU_NAV_H      SCALE_Y(32)                    // bottom page-nav strip height
#define SUBMENU_NAV_Y      (SCREEN_HEIGHT - SUBMENU_NAV_H + 2)
#define SUBMENU_NAV_BW     78                             // PREV/NEXT button width

static int submenuItemsPerPage() {
    int avail = SUBMENU_NAV_Y - SUBMENU_PAGE_TOP;
    int n = avail / SUBMENU_ROW_SP;
    return n < 1 ? 1 : n;
}
static int submenuPageCount() {
    int per = submenuItemsPerPage();
    int sz = active_submenu_size > 0 ? active_submenu_size : 1;
    return (sz + per - 1) / per;
}
// On-screen Y for global item i, or -1000 when i is not on the current page
// (so the per-handler isTouchInArea hit-tests simply never match off-page items).
static int submenuRowY(int i) {
    int per = submenuItemsPerPage();
    if (i / per != submenu_page) return -1000;
    return SUBMENU_PAGE_TOP + (i % per) * SUBMENU_ROW_SP;
}

static void drawSubmenuButton(int i, bool sel) {
    int yPos = submenuRowY(i);
    if (yPos < 0) return;                          // not on the current page
    int bx = 8, bw = SCREEN_WIDTH - 16, bh = SUBMENU_BTN_H;
    uint16_t fill   = sel ? WONTHOUND_VIOLET : WONTHOUND_DARK;
    uint16_t border = sel ? WONTHOUND_HOTPINK : WONTHOUND_MAGENTA;
    uint16_t txtcol = sel ? TFT_WHITE : WONTHOUND_MAGENTA;
    tft.fillRoundRect(bx, yPos, bw, bh, 6, fill);
    tft.drawRoundRect(bx, yPos, bw, bh, 6, border);
    tft.setTextFont(2);
    tft.setTextSize(1);
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(txtcol);
    tft.drawString(active_submenu_items[i], SCREEN_WIDTH / 2, yPos + bh / 2);
    tft.setTextDatum(TL_DATUM);
}

