Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
// Bottom page-navigation strip — only drawn when there is more than one page.
static void drawSubmenuNav() {
    int pages = submenuPageCount();
    if (pages <= 1) return;
    int navY = SUBMENU_NAV_Y, h = SUBMENU_NAV_H - 4, bw = SUBMENU_NAV_BW;
    tft.setTextFont(2);
    tft.setTextSize(1);
    tft.setTextDatum(MC_DATUM);
    if (submenu_page > 0) {
        tft.fillRoundRect(8, navY, bw, h, 5, WONTHOUND_DARK);
        tft.drawRoundRect(8, navY, bw, h, 5, WONTHOUND_MAGENTA);
        tft.setTextColor(WONTHOUND_HOTPINK);
        tft.drawString("< PREV", 8 + bw / 2, navY + h / 2);
    }
    if (submenu_page < pages - 1) {
        int nx = SCREEN_WIDTH - 8 - bw;
        tft.fillRoundRect(nx, navY, bw, h, 5, WONTHOUND_DARK);
        tft.drawRoundRect(nx, navY, bw, h, 5, WONTHOUND_MAGENTA);
        tft.setTextColor(WONTHOUND_HOTPINK);
        tft.drawString("NEXT >", nx + bw / 2, navY + h / 2);
    }
    char buf[12];
    snprintf(buf, sizeof(buf), "%d/%d", submenu_page + 1, pages);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.drawString(buf, SCREEN_WIDTH / 2, navY + h / 2);
    tft.setTextDatum(TL_DATUM);
}

void displaySubmenu() {
    menu_initialized = false;
    last_menu_index = -1;

    if (!submenu_initialized) {
        tft.fillScreen(TFT_BLACK);
        for (int i = 0; i < active_submenu_size; i++)
            drawSubmenuButton(i, i == current_submenu_index);
        drawSubmenuNav();
        submenu_initialized = true;
        last_submenu_index = current_submenu_index;
    }

    // Move highlight within the current page (redraw just the two affected buttons)
    if (last_submenu_index != current_submenu_index) {
        if (last_submenu_index >= 0) drawSubmenuButton(last_submenu_index, false);
        drawSubmenuButton(current_submenu_index, true);
        last_submenu_index = current_submenu_index;
    }

    drawStatusBar();
}

// PREV/NEXT hit-test for the bottom nav strip. Returns true if a page flip was
// consumed (screen already redrawn) so the caller bails out of this touch frame.
static bool handleSubmenuPaging() {
    int pages = submenuPageCount();
    if (pages <= 1) return false;
    int navY = SUBMENU_NAV_Y, h = SUBMENU_NAV_H - 4, bw = SUBMENU_NAV_BW;
    bool flip = false;
    if (submenu_page > 0 && isTouchInArea(8, navY, bw, h)) {
        submenu_page--; flip = true;
    } else if (submenu_page < pages - 1 && isTouchInArea(SCREEN_WIDTH - 8 - bw, navY, bw, h)) {
        submenu_page++; flip = true;
    }
    if (!flip) return false;
    submenu_initialized = false;
    last_submenu_index = -1;
    last_interaction_time = millis();
    waitForTouchRelease();
    displaySubmenu();
    delay(120);
    return true;
}

// ═══════════════════════════════════════════════════════════════════════════
// HOME MENU — scrollable app-grid (redesign: 2-col color tiles, drag-scroll).
// The canvas is taller than the screen, so items never clip — you scroll to them.
// ═══════════════════════════════════════════════════════════════════════════

#define GRID_COLS      2
#define GRID_CELL_W    (SCREEN_WIDTH / GRID_COLS)         // 120 on a 240px panel
#define GRID_TILE      WH_ICON_W                          // 100px square tile
#define GRID_TILE_PAD  ((GRID_CELL_W - GRID_TILE) / 2)    // center tile in its cell
#define GRID_LABEL_H   18
#define GRID_ROW_GAP   12
#define GRID_ROW_H     (GRID_TILE + GRID_LABEL_H + GRID_ROW_GAP)
#define GRID_TOP       34                                 // first row Y (below status bar)
#define GRID_BOTTOM    (SCREEN_HEIGHT - 4)                // content clips to screen edge

static TFT_eSprite *g_homeSpr = nullptr;

// ── Fixed single-screen "dashboard" home (same approach as the classic-CYD 3E) ──
// All 10 menu items live at static positions: 7 functional icons around the
// central Anonymous bulb + 3 utility icons (Tools/Setting/About) in a bottom bar.
// Drawn ONCE and never scrolled — zero flicker without relying on a PSRAM sprite,
// and every tap is a clean fixed hit-test rect (good for the resistive panel).
#define HOME_TITLE_H   28
#define HOME_BAR_TOP   250
#define HOME_BAR_H     66

// {x, y} top-left of each 50x50 icon, indexed by menu_items[]:
//  0 WiFi  1 Bluetooth  2 2.4GHz  3 SubGHz  4 RFID  5 JamDetect  6 SIGINT
//  | 7 Tools  8 Setting  9 About  (bottom utility bar)
static const int16_t HOME_ICON_XY[NUM_MENU_ITEMS][2] = {
    {  15,  52 },  // 0 WiFi        top-left
    {  15, 128 },  // 1 Bluetooth   mid-left
    {  95,  52 },  // 2 2.4GHz      top-center
    { 175,  52 },  // 3 SubGHz      top-right
    { 175, 128 },  // 4 RFID        mid-right
    { 175, 194 },  // 5 Jam Detect  low-right
    {  15, 194 },  // 6 SIGINT      low-left
    {  30, 258 },  // 7 Tools       bottom bar
    {  95, 258 },  // 8 Setting     bottom bar
    { 160, 258 },  // 9 About       bottom bar
};

// Screen-space top-left of menu tile i at the current scroll offset.
static void menuTileRect(int i, int *x, int *y) {
    int col = i % GRID_COLS;
    int row = i / GRID_COLS;
    *x = col * GRID_CELL_W + GRID_TILE_PAD;
    *y = GRID_TOP + row * GRID_ROW_H - menu_scroll_y;
}

static void clampMenuScroll() {
    int rows = (NUM_MENU_ITEMS + GRID_COLS - 1) / GRID_COLS;
    int contentH = rows * GRID_ROW_H;
    menu_max_scroll = max(0, contentH - (GRID_BOTTOM - GRID_TOP));
    if (menu_scroll_y < 0) menu_scroll_y = 0;
    if (menu_scroll_y > menu_max_scroll) menu_scroll_y = menu_max_scroll;
}

// Fixed overlays drawn on top of the scrolling grid: lock icon + status bar.
static void drawHomeOverlays() {
    if (pin_enabled) tft.drawBitmap(SCREEN_WIDTH - 20, 14, bitmap_icon_eye2, 16, 16, WONTHOUND_HOTPINK);
    drawStatusBar();
}

// Draw the fixed single-screen dashboard home in one static pass (see HOME_ICON_XY).
// No sprite / no scrolling = no flicker, regardless of PSRAM. Icons are drawn with
// the transparent color-key over the Anonymous-bulb background.
void drawMenuFrame() {
    // Background (Anonymous bulb), single static paint.
    tft.setSwapBytes(true);
    tft.pushImage(0, 0, WONTHOUND_BG_W, WONTHOUND_BG_H, wonthound_bg);

    // Bottom utility-bar frame (Tools / Setting / About).
    tft.drawRoundRect(8, HOME_BAR_TOP, SCREEN_WIDTH - 16, HOME_BAR_H, 10, WONTHOUND_VIOLET);

