Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
    // All 10 icons at their fixed positions (transparent color-key).
    for (int i = 0; i < NUM_MENU_ITEMS; i++) {
        tft.pushImage(HOME_ICON_XY[i][0], HOME_ICON_XY[i][1], WH_ICON_W, WH_ICON_H,
                      (uint16_t *)wh_menu_icons[i], WH_ICON_TRANSPARENT);
    }
    tft.setSwapBytes(false);

    // Title bar on top.
    tft.fillRect(0, 0, SCREEN_WIDTH, HOME_TITLE_H, WONTHOUND_DARK);
    tft.drawLine(0, HOME_TITLE_H, SCREEN_WIDTH, HOME_TITLE_H, WONTHOUND_VIOLET);
    tft.setTextDatum(TC_DATUM);
    tft.setTextFont(2);
    tft.setTextSize(1);
    tft.setTextColor(WONTHOUND_CYAN);
    tft.drawString("Main Menu", SCREEN_WIDTH / 2, 7);
    tft.setTextDatum(TL_DATUM);

    drawHomeOverlays();
}

void displayMenu() {
    submenu_initialized = false;
    last_submenu_index = -1;
    clampMenuScroll();
    drawMenuFrame();
    menu_initialized = true;
    last_menu_index = current_menu_index;
}

// ═══════════════════════════════════════════════════════════════════════════
// FEATURE RUNNER HELPER
// ═══════════════════════════════════════════════════════════════════════════

void returnToSubmenu() {
    in_sub_menu = true;
    is_main_menu = false;
    submenu_initialized = false;
    feature_active = false;
    feature_exit_requested = false;
    last_interaction_time = millis();
    displaySubmenu();
    delay(200);
}

void returnToMainMenu() {
    in_sub_menu = false;
    feature_active = false;
    feature_exit_requested = false;
    menu_initialized = false;
    last_interaction_time = millis();
    displayMenu();
    is_main_menu = false;
}

// ═══════════════════════════════════════════════════════════════════════════
// WIFI SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void handleWiFiSubmenuTouch() {
    touchButtonsUpdate();

    // Back button
    if (isBackButtonTapped()) {
        returnToMainMenu();
        return;
    }

    // Touch on submenu items
    if (handleSubmenuPaging()) return;
    for (int i = 0; i < active_submenu_size; i++) {
        int yPos = submenuRowY(i);

        if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
            current_submenu_index = i;
            last_interaction_time = millis();
            displaySubmenu();
            delay(200);

            // Execute selected item
            if (current_submenu_index == 8) { // Back
                returnToMainMenu();
                return;
            }

            feature_active = true;
            feature_exit_requested = false;
            waitForTouchRelease();

            switch (current_submenu_index) {
                case 0: // Packet Monitor
                    PacketMonitor::setup();
                    while (!feature_exit_requested) {
                        PacketMonitor::loop();
                        if (PacketMonitor::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    PacketMonitor::cleanup();
                    break;
                case 1: // Beacon Spammer
                    BeaconSpammer::setup();
                    while (!feature_exit_requested) {
                        BeaconSpammer::loop();
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    BeaconSpammer::cleanup();
                    break;
                case 2: // Deauther
                    Deauther::setup();
                    while (!feature_exit_requested) {
                        Deauther::loop();
                        touchButtonsUpdate();
                        if (Deauther::isExitRequested()) feature_exit_requested = true;
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    Deauther::cleanup();
                    break;
                case 3: // Probe Sniffer (with Evil Twin spawn)
                    DeauthDetect::setup();
                    while (!feature_exit_requested) {
                        DeauthDetect::loop();
                        touchButtonsUpdate();
                        if (DeauthDetect::isExitRequested()) feature_exit_requested = true;
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    // Check if user wants to spawn Evil Twin
                    if (DeauthDetect::isEvilTwinRequested()) {
                        char ssid[33];
                        strncpy(ssid, DeauthDetect::getSelectedSSID(), 32);
                        ssid[32] = '\0';
                        DeauthDetect::clearEvilTwinRequest();
                        DeauthDetect::cleanup();
                        // Set SSID and launch Captive Portal
                        CaptivePortal::setSSID(ssid);
                        CaptivePortal::setup();
                        feature_exit_requested = false;
                        while (!feature_exit_requested) {
                            CaptivePortal::loop();
                            touchButtonsUpdate();
                            if (CaptivePortal::isExitRequested()) feature_exit_requested = true;
                            if (isBackButtonTapped()) feature_exit_requested = true;
                        }
                        CaptivePortal::cleanup();
                    } else {
                        DeauthDetect::cleanup();
                    }
                    break;
                case 4: // WiFi Scanner v2.0 (with Tap-to-Attack)
                    WifiScan::setup();
                    while (!feature_exit_requested) {
                        WifiScan::loop();
                        if (WifiScan::isExitRequested()) feature_exit_requested = true;
                    }
                    // Check for attack handoff
                    if (WifiScan::isDeauthRequested()) {
                        // Pre-select target in Deauther from WifiScan
                        char bssid[18];
                        strncpy(bssid, WifiScan::getSelectedBSSID(), 17);
                        bssid[17] = '\0';
                        char ssid[33];
                        strncpy(ssid, WifiScan::getSelectedSSID(), 32);
                        ssid[32] = '\0';
                        int channel = WifiScan::getSelectedChannel();
                        WifiScan::clearAttackRequest();
                        WifiScan::cleanup();
                        Deauther::setTarget(bssid, ssid, channel);
                        Deauther::setup();
                        feature_exit_requested = false;
                        while (!feature_exit_requested) {
                            Deauther::loop();
                            touchButtonsUpdate();
                            if (Deauther::isExitRequested()) feature_exit_requested = true;
                            if (isBackButtonTapped()) feature_exit_requested = true;
                        }
                        Deauther::cleanup();
                    } else if (WifiScan::isCloneRequested()) {
                        char ssid[33];
                        strncpy(ssid, WifiScan::getSelectedSSID(), 32);
                        ssid[32] = '\0';
                        WifiScan::clearAttackRequest();
                        WifiScan::cleanup();
                        CaptivePortal::setSSID(ssid);
                        CaptivePortal::setup();
                        feature_exit_requested = false;
                        while (!feature_exit_requested) {
                            CaptivePortal::loop();
                            touchButtonsUpdate();
                            if (CaptivePortal::isExitRequested()) feature_exit_requested = true;
                            if (isBackButtonTapped()) feature_exit_requested = true;
                        }
                        CaptivePortal::cleanup();
                    } else {
                        WifiScan::cleanup();
                    }
                    break;
                case 5: // Captive Portal (GARMR Evil Twin)
                    CaptivePortal::setup();
                    while (!feature_exit_requested) {
                        CaptivePortal::loop();
                        touchButtonsUpdate();
                        if (CaptivePortal::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(50); if (IS_BOOT_PRESSED()) feature_exit_requested = true; }
                    }
                    CaptivePortal::cleanup();
                    break;
                case 6: // Station Scanner (with Deauth handoff)
                    StationScan::setup();
                    while (!feature_exit_requested) {
                        StationScan::loop();
                        if (StationScan::isExitRequested()) feature_exit_requested = true;
                    }
                    // Check for deauth handoff
                    if (StationScan::isDeauthRequested()) {
                        // Get selected station MACs and launch deauther
                        // Note: Station Scanner provides raw MACs, Deauther needs broadcast deauth
                        int selCount = StationScan::getSelectedCount();
                        StationScan::clearDeauthRequest();
                        StationScan::cleanup();
                        // For now, launch Deauther in scan mode - user picks network
                        // Future: Add client-targeted deauth to Deauther
                        Deauther::setup();
                        feature_exit_requested = false;
                        while (!feature_exit_requested) {
                            Deauther::loop();
                            touchButtonsUpdate();
                            if (Deauther::isExitRequested()) feature_exit_requested = true;
                            if (isBackButtonTapped()) feature_exit_requested = true;
                        }
                        Deauther::cleanup();
                    } else {
                        StationScan::cleanup();
                    }
                    break;
                case 7: // Auth Flood
                    AuthFlood::setup();
                    while (!feature_exit_requested) {
                        AuthFlood::loop();
                        if (AuthFlood::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    AuthFlood::cleanup();
                    break;
            }

