Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
            returnToSubmenu();
            break;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// BLUETOOTH SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void handleBluetoothSubmenuTouch() {
    touchButtonsUpdate();

    if (isBackButtonTapped()) {
        returnToMainMenu();
        return;
    }

    if (handleSubmenuPaging()) return;
    for (int i = 0; i < active_submenu_size; i++) {
        int yPos = submenuRowY(i);

        if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
            current_submenu_index = i;
            last_interaction_time = millis();
            displaySubmenu();
            delay(200);

            if (current_submenu_index == 6) { // Back
                returnToMainMenu();
                return;
            }

            feature_active = true;
            feature_exit_requested = false;
            waitForTouchRelease();

            switch (current_submenu_index) {
                case 0: // BLE Jammer
                    BleJammer::setup();
                    while (!feature_exit_requested) {
                        BleJammer::loop();
                        if (BleJammer::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                    }
                    BleJammer::cleanup();
                    break;
                case 1: // BLE Spoofer
                    BleSpoofer::setup();
                    while (!feature_exit_requested) {
                        BleSpoofer::loop();
                        if (BleSpoofer::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                    }
                    BleSpoofer::cleanup();
                    break;
                case 2: // BLE Beacon
                    BleBeacon::setup();
                    while (!feature_exit_requested) {
                        BleBeacon::loop();
                        if (BleBeacon::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                    }
                    BleBeacon::cleanup();
                    break;
                case 3: // BLE Predator (Listen / Find / Attack)
                    // Predator handles its own touch — no outer touchButtonsUpdate/isBackButtonTapped
                    BlePredator::setup();
                    while (!feature_exit_requested) {
                        BlePredator::loop();
                        if (BlePredator::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                    }
                    BlePredator::cleanup();
                    break;
                case 4: // WhisperPair (CVE-2025-36911)
                    WhisperPair::setup();
                    while (!feature_exit_requested) {
                        WhisperPair::loop();
                        if (WhisperPair::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                    }
                    WhisperPair::cleanup();
                    break;
                case 5: // Lunatic Fringe (Hub — tracker detect + AirTag tools)
                    handleLunaticFringeHubTouch();
                    break;
            }

            returnToSubmenu();
            break;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// LUNATIC FRINGE HUB SUBMENU HANDLER
// Contains: Tracker Scan, AirTag Detect, Phantom Flood, AirTag Replay, Back
// ═══════════════════════════════════════════════════════════════════════════

void handleLunaticFringeHubTouch() {
    // Swap active submenu pointers to Lunatic Fringe hub arrays
    active_submenu_items = (const char **)lunafringe_submenu_items_flash;
    active_submenu_size = lunafringe_NUM_SUBMENU_ITEMS;
    active_submenu_icons = (const unsigned char **)lunafringe_submenu_icons_flash;
    current_submenu_index = 0;
    submenu_page = 0;
    submenu_initialized = false;
    displaySubmenu();
    delay(200);

    bool in_hub = true;
    while (in_hub) {
        touchButtonsUpdate();

        // Icon bar back button — exit to Bluetooth menu
        if (isBackButtonTapped()) {
            break;
        }

        if (handleSubmenuPaging()) continue;
        for (int i = 0; i < lunafringe_NUM_SUBMENU_ITEMS; i++) {
            int yPos = submenuRowY(i);

            if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
                current_submenu_index = i;
                last_interaction_time = millis();
                displaySubmenu();
                delay(200);

                if (current_submenu_index == 4) { // Back
                    in_hub = false;
                    break;
                }

                feature_active = true;
                feature_exit_requested = false;
                waitForTouchRelease();

                switch (current_submenu_index) {
                    case 0: // Tracker Scan (multi-platform — current Lunatic Fringe)
                        LunaticFringe::setup();
                        while (!feature_exit_requested) {
                            LunaticFringe::loop();
                            if (LunaticFringe::isExitRequested()) feature_exit_requested = true;
                            if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                        }
                        LunaticFringe::cleanup();
                        break;
                    case 1: // AirTag Detect
                        AirTagDetect::setup();
                        while (!feature_exit_requested) {
                            AirTagDetect::loop();
                            if (AirTagDetect::isExitRequested()) feature_exit_requested = true;
                            touchButtonsUpdate();
                            if (isBackButtonTapped()) feature_exit_requested = true;
                            if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                        }
                        AirTagDetect::cleanup();
                        break;
                    case 2: // Phantom Flood (FindMy BLE Flood)
                        PhantomFlood::setup();
                        while (!feature_exit_requested) {
                            PhantomFlood::loop();
                            if (PhantomFlood::isExitRequested()) feature_exit_requested = true;
                            touchButtonsUpdate();
                            if (isBackButtonTapped()) feature_exit_requested = true;
                            if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                        }
                        PhantomFlood::cleanup();
                        break;
                    case 3: // AirTag Replay (Sniff + Replay)
                        AirTagReplay::setup();
                        while (!feature_exit_requested) {
                            AirTagReplay::loop();
                            if (AirTagReplay::isExitRequested()) feature_exit_requested = true;
                            touchButtonsUpdate();
                            if (isBackButtonTapped()) feature_exit_requested = true;
                            if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                        }
                        AirTagReplay::cleanup();
                        break;
                }

