Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
                // After module exits, return to Lunatic Fringe hub (NOT Bluetooth menu)
                feature_active = false;
                feature_exit_requested = false;
                active_submenu_items = (const char **)lunafringe_submenu_items_flash;
                active_submenu_size = lunafringe_NUM_SUBMENU_ITEMS;
                active_submenu_icons = (const unsigned char **)lunafringe_submenu_icons_flash;
                current_submenu_index = 0;
                submenu_page = 0;
                submenu_initialized = false;
                displaySubmenu();
                delay(200);
                break;  // break out of for loop, continue while loop
            }
        }
    }

    // Restore Bluetooth submenu pointers for caller's returnToSubmenu()
    active_submenu_items = bluetooth_submenu_items;
    active_submenu_size = bluetooth_NUM_SUBMENU_ITEMS;
    active_submenu_icons = bluetooth_submenu_icons;
    current_submenu_index = 0;
    submenu_initialized = false;
}

// ═══════════════════════════════════════════════════════════════════════════
// NRF24 2.4GHz SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void handleNRFSubmenuTouch() {
    touchButtonsUpdate();

    if (isBackButtonTapped()) {
        returnToMainMenu();
        return;
    }

    if (handleSubmenuPaging()) return;
    for (int i = 0; i < active_submenu_size; i++) {
        int yPos = submenuRowY(i);

        if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
            current_submenu_index = i;
            last_interaction_time = millis();
            displaySubmenu();
            delay(200);

            if (current_submenu_index == 6) { // Back
                returnToMainMenu();
                return;
            }

            feature_active = true;
            feature_exit_requested = false;
            waitForTouchRelease();

            switch (current_submenu_index) {
                case 0: // Scanner
                    Scanner::scannerSetup();
                    while (!feature_exit_requested) {
                        Scanner::scannerLoop();
                        if (Scanner::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    Scanner::cleanup();
                    break;
                case 1: // Spectrum Analyzer
                    Analyzer::analyzerSetup();
                    while (!feature_exit_requested) {
                        Analyzer::analyzerLoop();
                        if (Analyzer::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    Analyzer::cleanup();
                    break;
                case 2: // NRF Sniffer
                    NrfSniffer::setup();
                    while (!feature_exit_requested) {
                        NrfSniffer::loop();
                        if (NrfSniffer::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    NrfSniffer::cleanup();
                    break;
                case 3: // MouseJack
                    MouseJack::setup();
                    while (!feature_exit_requested) {
                        MouseJack::loop();
                        if (MouseJack::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    MouseJack::cleanup();
                    break;
                case 4: // WLAN Jammer
                    WLANJammer::wlanjammerSetup();
                    while (!feature_exit_requested) {
                        WLANJammer::wlanjammerLoop();
                        if (WLANJammer::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    WLANJammer::cleanup();
                    break;
                case 5: // Proto Kill
                    ProtoKill::prokillSetup();
                    while (!feature_exit_requested) {
                        ProtoKill::prokillLoop();
                        if (ProtoKill::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    ProtoKill::cleanup();
                    break;
            }

            returnToSubmenu();
            break;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// SUBGHZ SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void handleSubGHzSubmenuTouch() {
    touchButtonsUpdate();

    if (isBackButtonTapped()) {
        returnToMainMenu();
        return;
    }

    if (handleSubmenuPaging()) return;
    for (int i = 0; i < active_submenu_size; i++) {
        int yPos = submenuRowY(i);

        if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
            current_submenu_index = i;
            last_interaction_time = millis();
            displaySubmenu();
            delay(200);

            if (current_submenu_index == active_submenu_size - 1) { // Back
                returnToMainMenu();
                return;
            }

            feature_active = true;
            feature_exit_requested = false;
            waitForTouchRelease();

            switch (current_submenu_index) {
                case 0: // Replay Attack
                    ReplayAttack::setup();
                    while (!feature_exit_requested) {
                        ReplayAttack::loop();
                        if (ReplayAttack::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    ReplayAttack::cleanup();
                    break;
                case 1: // Brute Force
                    SubBrute::setup();
                    while (!feature_exit_requested) {
                        SubBrute::loop();
                        if (SubBrute::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;  // BOOT button direct
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    SubBrute::cleanup();
                    break;
                case 2: // SubGHz Jammer
                    SubJammer::setup();
                    while (!feature_exit_requested) {
                        SubJammer::loop();
                        if (SubJammer::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;  // BOOT button direct
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    SubJammer::cleanup();
                    break;
                case 3: // Spectrum Analyzer
                    SubAnalyzer::setup();
                    while (!feature_exit_requested) {
                        SubAnalyzer::loop();
                        if (SubAnalyzer::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;  // BOOT button direct
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    SubAnalyzer::cleanup();
                    break;
                case 4: // Saved Profile
                    SavedProfile::saveSetup();
                    while (!feature_exit_requested) {
                        SavedProfile::saveLoop();
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    break;
            }

