Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
            returnToSubmenu();
            break;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// SIGINT SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void showSigintPlaceholder(const char* title) {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();
    drawGlitchTitle(75, title);
    drawGlitchStatus(110, "BUILDING...", WONTHOUND_HOTPINK);
    drawCenteredText(150, "Module under construction", WONTHOUND_MAGENTA, 1);

    while (true) {
        touchButtonsUpdate();
        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) break;
        delay(50);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// RFID SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void handleRFIDSubmenuTouch() {
    touchButtonsUpdate();

    if (isBackButtonTapped()) {
        returnToMainMenu();
        return;
    }

    if (handleSubmenuPaging()) return;
    for (int i = 0; i < active_submenu_size; i++) {
        int yPos = submenuRowY(i);

        if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
            current_submenu_index = i;
            last_interaction_time = millis();
            displaySubmenu();
            delay(200);

            if (current_submenu_index == active_submenu_size - 1) { // Back
                returnToMainMenu();
                return;
            }

            feature_active = true;
            feature_exit_requested = false;
            waitForTouchRelease();

            switch (current_submenu_index) {
                case 0: // Card Scanner
                    RFIDScanner::setup();
                    while (!feature_exit_requested) {
                        RFIDScanner::loop();
                        if (RFIDScanner::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (isInoBackTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    RFIDScanner::cleanup();
                    break;
                case 1: // Card Reader
                    RFIDReader::setup();
                    while (!feature_exit_requested) {
                        RFIDReader::loop();
                        if (RFIDReader::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (isInoBackTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    RFIDReader::cleanup();
                    break;
                case 2: // Card Clone
                    RFIDClone::setup();
                    while (!feature_exit_requested) {
                        RFIDClone::loop();
                        if (RFIDClone::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (isInoBackTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    RFIDClone::cleanup();
                    break;
                case 3: // Key Brute Force
                    RFIDBrute::setup();
                    while (!feature_exit_requested) {
                        RFIDBrute::loop();
                        if (RFIDBrute::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (isInoBackTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    RFIDBrute::cleanup();
                    break;
                case 4: // Card Emulate
                    RFIDEmulate::setup();
                    while (!feature_exit_requested) {
                        RFIDEmulate::loop();
                        if (RFIDEmulate::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (isInoBackTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    RFIDEmulate::cleanup();
                    break;
            }

            returnToSubmenu();
            break;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// JAM DETECT SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void handleJamDetectSubmenuTouch() {
    touchButtonsUpdate();

    if (isBackButtonTapped()) {
        returnToMainMenu();
        return;
    }

    if (handleSubmenuPaging()) return;
    for (int i = 0; i < active_submenu_size; i++) {
        int yPos = submenuRowY(i);

        if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
            current_submenu_index = i;
            last_interaction_time = millis();
            displaySubmenu();
            delay(200);

            if (current_submenu_index == 4) { // Back
                returnToMainMenu();
                return;
            }

            feature_active = true;
            feature_exit_requested = false;
            waitForTouchRelease();

            switch (current_submenu_index) {
                case 0: // WiFi Guardian
                    WiFiGuardian::setup();
                    while (!feature_exit_requested) {
                        WiFiGuardian::loop();
                        if (WiFiGuardian::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    WiFiGuardian::cleanup();
                    break;
                case 1: // SubGHz Sentinel
                    SubSentinel::setup();
                    while (!feature_exit_requested) {
                        SubSentinel::loop();
                        if (SubSentinel::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    SubSentinel::cleanup();
                    break;
                case 2: // 2.4GHz Watchdog
                    GHzWatchdog::setup();
                    while (!feature_exit_requested) {
                        GHzWatchdog::loop();
                        if (GHzWatchdog::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    GHzWatchdog::cleanup();
                    break;
                case 3: // Full Spectrum
                    FullSpectrum::setup();
                    while (!feature_exit_requested) {
                        FullSpectrum::loop();
                        if (FullSpectrum::isExitRequested()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    FullSpectrum::cleanup();
                    break;
            }

