Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
            returnToSubmenu();
            break;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// SIGINT SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void handleSIGINTSubmenuTouch() {
    touchButtonsUpdate();

    if (isBackButtonTapped()) {
        returnToMainMenu();
        return;
    }

    if (handleSubmenuPaging()) return;
    for (int i = 0; i < active_submenu_size; i++) {
        int yPos = submenuRowY(i);

        if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
            current_submenu_index = i;
            last_interaction_time = millis();
            displaySubmenu();
            delay(200);

            if (current_submenu_index == 7) { // Back
                returnToMainMenu();
                return;
            }

            feature_active = true;
            feature_exit_requested = false;
            waitForTouchRelease();

            switch (current_submenu_index) {
                case 0: // EAPOL Capture
                    EapolCapture::setup();
                    while (!feature_exit_requested) {
                        EapolCapture::loop();
                        if (EapolCapture::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                        // No external isBackButtonTapped() — EAPOL handles its own
                        // back navigation internally (CAPTURE→SCAN→EXIT)
                    }
                    EapolCapture::cleanup();
                    break;
                case 1: // Karma Attack
                    KarmaAttack::setup();
                    while (!feature_exit_requested) {
                        KarmaAttack::loop();
                        if (KarmaAttack::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    KarmaAttack::cleanup();
                    break;
                case 2: // Wardriving
                    wardrivingScreen();
                    break;
                case 3: // Saved Captures
                    SavedCaptures::setup();
                    while (!feature_exit_requested) {
                        SavedCaptures::loop();
                        if (SavedCaptures::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                        touchButtonsUpdate();
                        if (isBackButtonTapped()) feature_exit_requested = true;
                    }
                    SavedCaptures::cleanup();
                    break;
                case 4: // IoT Recon
                    IotRecon::setup();
                    while (!feature_exit_requested) {
                        IotRecon::loop();
                        if (IotRecon::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                    }
                    IotRecon::cleanup();
                    break;
                case 5: // Loot
                    LootManager::setup();
                    while (!feature_exit_requested) {
                        LootManager::loop();
                        if (LootManager::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) feature_exit_requested = true;
                    }
                    LootManager::cleanup();
                    break;
                case 6: // Flock You — Passive surveillance camera detector
                    FlockYou::setup();
                    while (!feature_exit_requested) {
                        FlockYou::loop();
                        if (FlockYou::isExitRequested()) feature_exit_requested = true;
                        if (IS_BOOT_PRESSED()) { delay(200); feature_exit_requested = true; }
                    }
                    FlockYou::cleanup();
                    break;
            }

            returnToSubmenu();
            break;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// TOOLS SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void handleToolsSubmenuTouch() {
    touchButtonsUpdate();

    if (isBackButtonTapped()) {
        returnToMainMenu();
        return;
    }

    if (handleSubmenuPaging()) return;
    for (int i = 0; i < active_submenu_size; i++) {
        int yPos = submenuRowY(i);

        if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
            current_submenu_index = i;
            last_interaction_time = millis();
            displaySubmenu();
            delay(200);
            waitForTouchRelease();

            if (current_submenu_index == active_submenu_size - 1) { // Back
                returnToMainMenu();
                return;
            }

            // Touch Calibrate - run calibration routine
            if (current_submenu_index == 2) {
                runTouchCalibration();
                returnToSubmenu();
                break;
            }

            // GPS - launch GPS screen
            if (current_submenu_index == 3) {
                gpsScreen();
                returnToSubmenu();
                break;
            }

            // Radio Test - SPI radio hardware verification
            if (current_submenu_index == 4) {
                radioTestScreen();
                returnToSubmenu();
                break;
            }

#if defined(ESP32S3_ES3C28P) && CYD_HAS_AUDIO
            // S3 Audio - ES8311 mic/codec live level test
            if (current_submenu_index == 5) {
                s3AudioTestScreen();
                returnToSubmenu();
                break;
            }
#endif

            // Serial Monitor - launch UART terminal
            if (current_submenu_index == 0) {
                serialMonitorScreen();
                returnToSubmenu();
                break;
            }

            // Firmware Update - flash .bin from SD card
            if (current_submenu_index == 1) {
                firmwareUpdateScreen();
                returnToSubmenu();
                break;
            }
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// SETTINGS SUBMENU HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void displayBrightnessControl() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();  // Icon bar instead of title bar

    // Title — glitch effect
    drawGlitchTitle(75, "BRIGHTNESS");

    // Draw brightness bar
    int barX = SCREEN_WIDTH / 8;
    int barW = SCREEN_WIDTH * 3 / 4;
    tft.drawRect(barX, 90, barW, 30, WONTHOUND_MAGENTA);
    int bar_width = map(brightness_level, 0, 255, 0, barW - 4);
    tft.fillRect(barX + 2, 92, bar_width, 26, WONTHOUND_MAGENTA);

