Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
    // Show percentage
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    int percent = map(brightness_level, 0, 255, 0, 100);
    tft.setCursor(90, 135);
    tft.printf("%d%%", percent);

    // Touch zones
    tft.setTextSize(1);
    int btnW = (SCREEN_WIDTH - 30) / 2;  // two buttons with gaps
    int btnL = 10;
    int btnR = btnL + btnW + 10;
    tft.fillRect(btnL, 180, btnW, 40, WONTHOUND_DARK);
    tft.drawRect(btnL, 180, btnW, 40, WONTHOUND_MAGENTA);
    tft.setCursor(btnL + 20, 195);
    tft.print("DARKER");

    tft.fillRect(btnR, 180, btnW, 40, WONTHOUND_DARK);
    tft.drawRect(btnR, 180, btnW, 40, WONTHOUND_MAGENTA);
    tft.setCursor(btnR + 15, 195);
    tft.print("BRIGHTER");
}

void brightnessControlLoop() {
    displayBrightnessControl();

    while (!feature_exit_requested) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            feature_exit_requested = true;
            saveSettings();
            break;
        }

        // Darker button
        if (isTouchInArea(30, 180, 80, 40)) {
            brightness_level = max(10, brightness_level - 25);
            setBacklightLevel((uint8_t)brightness_level);
            displayBrightnessControl();
            delay(150);
        }

        // Brighter button
        if (isTouchInArea(130, 180, 80, 40)) {
            brightness_level = min(255, brightness_level + 25);
            setBacklightLevel((uint8_t)brightness_level);
            displayBrightnessControl();
            delay(150);
        }

        delay(50);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// SCREEN TIMEOUT CONTROL
// ═══════════════════════════════════════════════════════════════════════════

int getTimeoutOptionIndex() {
    for (int i = 0; i < numTimeoutOptions; i++) {
        if (timeoutOptions[i] == screen_timeout_seconds) return i;
    }
    return 1;  // default to 1 MIN if not found
}

void displayTimeoutControl() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();

    drawGlitchTitle(75, "TIMEOUT");

    // Current value display
    int idx = getTimeoutOptionIndex();
    tft.drawRoundRect(30, 95, 180, 40, 6, WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    tft.setTextColor(WONTHOUND_HOTPINK, TFT_BLACK);
    int tw = strlen(timeoutLabels[idx]) * 12;
    tft.setCursor((tft.width() - tw) / 2, 105);
    tft.print(timeoutLabels[idx]);

    // Arrow hints
    tft.setTextSize(1);
    tft.setTextColor(WONTHOUND_GUNMETAL, TFT_BLACK);
    tft.setCursor(38, 110);
    tft.print("<");
    tft.setCursor(200, 110);
    tft.print(">");

    // Left / Right buttons
    tft.fillRect(30, 160, 80, 40, WONTHOUND_DARK);
    tft.drawRect(30, 160, 80, 40, WONTHOUND_MAGENTA);
    tft.setTextSize(1);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(50, 175);
    tft.print("SHORTER");

    tft.fillRect(130, 160, 80, 40, WONTHOUND_DARK);
    tft.drawRect(130, 160, 80, 40, WONTHOUND_MAGENTA);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(148, 175);
    tft.print("LONGER");

    // Description
    tft.setTextSize(1);
    tft.setTextColor(WONTHOUND_GUNMETAL);
    if (screen_timeout_seconds == 0) {
        tft.setCursor(40, 230);
        tft.print("Screen stays on always");
    } else {
        tft.setCursor(22, 230);
        tft.print("Screen dims after inactivity");
    }
}

void screenTimeoutControlLoop() {
    displayTimeoutControl();

    while (!feature_exit_requested) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            feature_exit_requested = true;
            saveSettings();
            break;
        }

        // Shorter button (left)
        if (isTouchInArea(30, 160, 80, 40)) {
            int idx = getTimeoutOptionIndex();
            if (idx > 0) {
                idx--;
                screen_timeout_seconds = timeoutOptions[idx];
                displayTimeoutControl();
            }
            delay(200);
        }

        // Longer button (right)
        if (isTouchInArea(130, 160, 80, 40)) {
            int idx = getTimeoutOptionIndex();
            if (idx < numTimeoutOptions - 1) {
                idx++;
                screen_timeout_seconds = timeoutOptions[idx];
                displayTimeoutControl();
            }
            delay(200);
        }

        delay(50);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// COLOR SWAP CONTROL (BGR / RGB panel toggle)
// ═══════════════════════════════════════════════════════════════════════════

void displayColorSwap() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();

    drawGlitchTitle(60, "COLORS");

    // Current mode display
    tft.drawRoundRect(20, 95, 200, 50, 6, WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    tft.setTextColor(WONTHOUND_HOTPINK, TFT_BLACK);
    if (color_order_rgb) {
        tft.setCursor(72, 108);
        tft.print("RGB");
    } else {
        tft.setCursor(52, 108);
        tft.print("BGR *");
    }

    // Description
    tft.setTextSize(1);
    tft.setTextColor(WONTHOUND_GUNMETAL);
    tft.setCursor(20, 160);
    tft.print("If colors look wrong (green");
    tft.setCursor(20, 172);
    tft.print("instead of pink), tap SWAP.");
    tft.setCursor(20, 192);
    tft.print("* = default for most boards");

    // Swap button
    tft.fillRect(50, 225, 140, 45, WONTHOUND_DARK);
    tft.drawRect(50, 225, 140, 45, WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(82, 238);
    tft.print("SWAP");
}

void colorSwapLoop() {
    displayColorSwap();

    while (!feature_exit_requested) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            feature_exit_requested = true;
            saveSettings();
            break;
        }

        // Swap button
        if (isTouchInArea(50, 225, 140, 45)) {
            color_order_rgb = !color_order_rgb;
            applyColorOrder();
            saveSettings();
            displayColorSwap();
            delay(300);
        }

        delay(50);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// INVERT DISPLAY CONTROL
// ═══════════════════════════════════════════════════════════════════════════

void displayInvertScreen() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();

