Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
    drawGlitchTitle(60, "INVERT");

    // Current mode display
    tft.drawRoundRect(20, 95, 200, 50, 6, WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    tft.setTextColor(WONTHOUND_HOTPINK, TFT_BLACK);
    if (display_inverted) {
        tft.setCursor(52, 108);
        tft.print("INVERTED");
    } else {
        tft.setCursor(52, 108);
        tft.print("NORMAL *");
    }

    // Description
    tft.setTextSize(1);
    tft.setTextColor(WONTHOUND_GUNMETAL);
    tft.setCursor(20, 160);
    tft.print("If colors are washed out or");
    tft.setCursor(20, 172);
    tft.print("inverted, tap TOGGLE.");
    tft.setCursor(20, 192);
    tft.print("* = default for most boards");

    // Toggle button
    tft.fillRect(50, 225, 140, 45, WONTHOUND_DARK);
    tft.drawRect(50, 225, 140, 45, WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(65, 238);
    tft.print("TOGGLE");
}

void invertDisplayLoop() {
    displayInvertScreen();

    while (!feature_exit_requested) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            feature_exit_requested = true;
            saveSettings();
            break;
        }

        // Toggle button
        if (isTouchInArea(50, 225, 140, 45)) {
            display_inverted = !display_inverted;
            tft.invertDisplay(display_inverted);
            saveSettings();
            displayInvertScreen();
            delay(300);
        }

        delay(50);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// COLOR MODE SELECTOR
// 3 palettes: Default (pink/purple), Colorblind (blue/yellow), Hi-Contrast
// ═══════════════════════════════════════════════════════════════════════════

void colorModeScreen() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();

    drawGlitchTitle(60, "COLORS");

    // Current mode name in rounded rect
    tft.drawRoundRect(20, 95, 200, 50, 6, WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    tft.setTextColor(WONTHOUND_HOTPINK, TFT_BLACK);
    const char* modeNames[] = {"DEFAULT", "COLORBLIND", "HI-CONTRAST"};
    const char* modeName = (color_mode < 3) ? modeNames[color_mode] : modeNames[0];
    int nameLen = strlen(modeName);
    int nameX = (CYD_SCREEN_WIDTH - nameLen * 12) / 2;
    tft.setCursor(nameX, 108);
    tft.print(modeName);

    // Color preview strip — 6 swatches showing the active theme
    int swatchW = 30;
    int swatchH = 20;
    int swatchY = 155;
    int swatchStartX = 10;
    uint16_t swatches[] = {WONTHOUND_MAGENTA, WONTHOUND_HOTPINK, WONTHOUND_BRIGHT,
                           WONTHOUND_VIOLET, WONTHOUND_MAGENTA, WONTHOUND_GREEN};
    for (int i = 0; i < 6; i++) {
        int sx = swatchStartX + i * (swatchW + 7);
        tft.fillRect(sx, swatchY, swatchW, swatchH, swatches[i]);
        tft.drawRect(sx, swatchY, swatchW, swatchH, WONTHOUND_GUNMETAL);
    }

    // Description
    tft.setTextSize(1);
    tft.setTextColor(WONTHOUND_GUNMETAL);
    tft.setCursor(20, 185);
    tft.print("Tap NEXT to cycle modes.");
    tft.setCursor(20, 197);
    tft.print("Changes apply instantly.");

    // NEXT button
    tft.fillRect(50, 225, 140, 45, WONTHOUND_DARK);
    tft.drawRect(50, 225, 140, 45, WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(80, 238);
    tft.print("NEXT");
}

void colorModeLoop() {
    colorModeScreen();

    while (!feature_exit_requested) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            feature_exit_requested = true;
            saveSettings();
            break;
        }

        // NEXT button — cycle through 3 modes
        if (isTouchInArea(50, 225, 140, 45)) {
            color_mode = (color_mode + 1) % 3;
            applyColorMode(color_mode);
            saveSettings();
            colorModeScreen();
            delay(300);
        }

        delay(50);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// ROTATION CONTROL
// ═══════════════════════════════════════════════════════════════════════════

void displayRotationScreen() {
    int sw = tft.width();
    int sh = tft.height();

    tft.fillScreen(TFT_BLACK);
    tft.drawRect(2, 2, sw - 4, sh - 4, WONTHOUND_HOTPINK);
    tft.drawLine(0, ICON_BAR_TOP, sw, ICON_BAR_TOP, WONTHOUND_MAGENTA);
    tft.fillRect(0, ICON_BAR_Y, sw, ICON_BAR_H, WONTHOUND_DARK);
    tft.drawBitmap(10, ICON_BAR_Y, bitmap_icon_go_back, 16, 16, WONTHOUND_MAGENTA);
    tft.drawLine(0, ICON_BAR_BOTTOM, sw, ICON_BAR_BOTTOM, WONTHOUND_HOTPINK);

    drawGlitchTitle(48, "ROTATION");

    // Current rotation label
    tft.setTextSize(1);
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(15, 72);
    tft.print("Current: ");
    tft.setTextColor(WONTHOUND_MAGENTA);
    const char* rotNames[] = {"Standard", "Landscape CW", "Flipped 180", "Landscape CCW"};
    tft.print(rotNames[screen_rotation]);

    // 4 rotation options — compact layout
    const uint8_t rotVals[] = {0, 2, 1, 3};
    const char* rotLabels[] = {"Standard", "Flipped 180", "90 CW", "90 CCW"};
    const char* rotDescs[] = {"USB at bottom", "USB at top", "USB at left", "USB at right"};
    int boxW = sw - 40;
    int boxH = 35;
    int startY = 88;
    int gap = 4;

    for (int i = 0; i < 4; i++) {
        int y = startY + i * (boxH + gap);
        uint16_t col = (screen_rotation == rotVals[i]) ? WONTHOUND_HOTPINK : WONTHOUND_MAGENTA;
        tft.drawRect(20, y, boxW, boxH, col);
        tft.setTextColor(col);
        tft.setTextSize(2);
        tft.setCursor(30, y + 4);
        tft.print(rotLabels[i]);
        tft.setTextSize(1);
        tft.setTextColor(TFT_WHITE);
        tft.setCursor(30, y + 22);
        tft.print(rotDescs[i]);
    }

    // Info text
    int infoY = startY + 4 * (boxH + gap) + 4;
    tft.setTextColor(WONTHOUND_VIOLET);
    tft.setTextSize(1);
    tft.setCursor(15, infoY);
    tft.print("Touch recal runs after change.");

    tft.setTextColor(TFT_DARKGREY);
    tft.setCursor(15, infoY + 16);
    tft.print("BOOT button = back");
}

static void applyNewRotation(uint8_t newRot) {
    extern bool touch_calibrated;

    screen_rotation = newRot;
    tft.setRotation(newRot);
    applyColorOrder();

    // Invalidate touch calibration — axes change with rotation
    touch_calibrated = false;
    saveSettings();

    // Screen just changed — run calibration immediately
    runTouchCalibration();
}

