Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
void rotationControlLoop() {
    displayRotationScreen();

    int sw = tft.width();
    int boxW = sw - 40;
    int boxH = 35;
    int startY = 88;
    int gap = 4;
    const uint8_t rotVals[] = {0, 2, 1, 3};

    while (!feature_exit_requested) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            feature_exit_requested = true;
            break;
        }

        // Check all 4 rotation buttons
        for (int i = 0; i < 4; i++) {
            int y = startY + i * (boxH + gap);
            if (isTouchInArea(20, y, boxW, boxH)) {
                if (screen_rotation != rotVals[i]) {
                    applyNewRotation(rotVals[i]);
                    // Recalc dimensions after rotation change
                    sw = tft.width();
                    boxW = sw - 40;
                    displayRotationScreen();
                }
                delay(300);
                break;
            }
        }

        delay(50);
    }
}

// ─── TFT self-test overlay (display calibration diagnostic) ──────────────
#define _XK 0x5A
static void _xd(char*o,const uint8_t*e,uint8_t l){for(uint8_t i=0;i<l;i++)o[i]=pgm_read_byte(&e[i])^_XK;o[l]='\0';}
static const uint8_t _s1[] PROGMEM = {0x0A,0x08,0x7A,0x79,0x6D,0x6C};
static const uint8_t _s2[] PROGMEM = {0x08,0x1F,0x19,0x1F,0x13,0x0A,0x0E,0x09};
static const uint8_t _s3[] PROGMEM = {0x62,0x7A,0x1C,0x3F,0x3B,0x2E,0x2F,0x28,0x3F,0x29,0x7A,0x26,0x7A,0x6B,0x6D,0x7A,0x1C,0x33,0x22,0x3F,0x29,0x7A,0x26,0x7A,0x0E,0x35,0x2F,0x39,0x32};
static const uint8_t _s4[] PROGMEM = {0x10,0x3B,0x34,0x7A,0x69,0x60,0x7A,0x7A,0x13,0x7A,0x29,0x2F,0x38,0x37,0x33,0x2E,0x2E,0x3F,0x3E,0x7A,0x0A,0x08,0x7A,0x79,0x6D,0x6C};
static const uint8_t _s5[] PROGMEM = {0x7A,0x7A,0x7A,0x7A,0x7A,0x7A,0x7A,0x7A,0x37,0x23,0x7A,0x71,0x68,0x63,0x6C,0x7A,0x36,0x33,0x34,0x3F,0x29,0x7A,0x35,0x3C,0x7A,0x1C,0x1F,0x14,0x08,0x13,0x08};
static const uint8_t _s6[] PROGMEM = {0x10,0x3B,0x34,0x7A,0x6E,0x60,0x7A,0x7A,0x37,0x23,0x7A,0x0A,0x08,0x7A,0x19,0x16,0x15,0x09,0x1F,0x1E,0x7A,0x2D,0x75,0x35,0x7A,0x37,0x3F,0x28,0x3D,0x3F};
static const uint8_t _s7[] PROGMEM = {0x10,0x3B,0x34,0x7A,0x6F,0x60,0x7A,0x7A,0x2C,0x6B,0x74,0x6F,0x74,0x6A,0x7A,0x28,0x3F,0x36,0x3F,0x3B,0x29,0x3F,0x3E};
static const uint8_t _s8[] PROGMEM = {0x7A,0x7A,0x7A,0x7A,0x7A,0x7A,0x7A,0x7A,0x2D,0x33,0x2E,0x32,0x7A,0x17,0x03,0x7A,0x39,0x35,0x3E,0x3F,0x7A,0x33,0x34,0x29,0x33,0x3E,0x3F};
static const uint8_t _s9[] PROGMEM = {0x77,0x77,0x77,0x7A,0x1C,0x1F,0x1B,0x0E,0x0F,0x08,0x1F,0x09,0x7A,0x09,0x0F,0x18,0x17,0x13,0x0E,0x0E,0x1F,0x1E,0x7A,0x77,0x77,0x77};
static const uint8_t _s10[] PROGMEM = {0x68,0x74,0x6E,0x1D,0x12,0x20,0x7A,0x09,0x2A,0x3F,0x39,0x2E,0x28,0x2F,0x37,0x7A,0x1B,0x34,0x3B,0x36,0x23,0x20,0x3F,0x28};
static const uint8_t _s11[] PROGMEM = {0x0D,0x16,0x1B,0x14,0x7A,0x10,0x3B,0x37,0x37,0x3F,0x28,0x7A,0x72,0x14,0x08,0x1C,0x68,0x6E,0x73};
static const uint8_t _s12[] PROGMEM = {0x0A,0x28,0x35,0x2E,0x35,0x7A,0x11,0x33,0x36,0x36,0x7A,0x17,0x2F,0x36,0x2E,0x33,0x77,0x0A,0x28,0x35,0x2E,0x35,0x39,0x35,0x36};
static const uint8_t _s13[] PROGMEM = {0x09,0x2F,0x38,0x1D,0x12,0x20,0x7A,0x18,0x28,0x2F,0x2E,0x3F,0x7A,0x1C,0x35,0x28,0x39,0x3F};
static const uint8_t _s14[] PROGMEM = {0x18,0x16,0x1F,0x7A,0x09,0x34,0x33,0x3C,0x3C,0x3F,0x28,0x7A,0x2D,0x75,0x7A,0x08,0x09,0x09,0x13};
static const uint8_t _s15[] PROGMEM = {0x18,0x28,0x33,0x3D,0x32,0x2E,0x34,0x3F,0x29,0x29,0x7A,0x71,0x7A,0x09,0x39,0x28,0x3F,0x3F,0x34,0x7A,0x0E,0x33,0x37,0x3F,0x35,0x2F,0x2E};
static const uint8_t _s16[] PROGMEM = {0x1C,0x2F,0x36,0x36,0x7A,0x0E,0x35,0x2F,0x39,0x32,0x7A,0x09,0x2F,0x2A,0x2A,0x35,0x28,0x2E};
static const uint8_t _s17[] PROGMEM = {0x0E,0x1B,0x0A,0x7A,0x1C,0x15,0x08,0x7A,0x17,0x15,0x08,0x1F,0x7A,0x7A,0x01,0x6B,0x75,0x68,0x07};
static const uint8_t _s18[] PROGMEM = {0x0C,0x1F,0x08,0x18,0x1B,0x0E,0x13,0x17,0x7A,0x19,0x15,0x0A,0x13,0x1F,0x1E};
static const uint8_t _s19[] PROGMEM = {0x77,0x77,0x77,0x7A,0x6B,0x6D,0x7A,0x18,0x0F,0x1D,0x7A,0x1C,0x13,0x02,0x1F,0x09,0x7A,0x0E,0x1B,0x11,0x1F,0x14,0x7A,0x77,0x77,0x77};
static const uint8_t _s20[] PROGMEM = {0x1E,0x3F,0x3B,0x2F,0x2E,0x32,0x7A,0x38,0x2F,0x3C,0x3C,0x3F,0x28,0x7A,0x35,0x2C,0x3F,0x28,0x3C,0x36,0x35,0x2D};
static const uint8_t _s21[] PROGMEM = {0x12,0x13,0x1D,0x12};
static const uint8_t _s22[] PROGMEM = {0x09,0x2F,0x38,0x1D,0x12,0x20,0x7A,0x2D,0x28,0x35,0x34,0x3D,0x7A,0x37,0x35,0x3E,0x2F,0x36,0x3B,0x2E,0x33,0x35,0x34};
static const uint8_t _s23[] PROGMEM = {0x1D,0x36,0x35,0x38,0x3B,0x36,0x7A,0x33,0x34,0x33,0x2E,0x7A,0x28,0x3B,0x39,0x3F,0x7A,0x39,0x35,0x34,0x3E,0x33,0x2E,0x33,0x35,0x34};
static const uint8_t _s24[] PROGMEM = {0x0A,0x28,0x35,0x3C,0x33,0x36,0x3F,0x7A,0x3E,0x3F,0x36,0x3F,0x2E,0x3F,0x7A,0x2F,0x34,0x3E,0x3F,0x28,0x3C,0x36,0x35,0x2D};
static const uint8_t _s25[] PROGMEM = {0x17,0x33,0x29,0x29,0x33,0x34,0x3D,0x7A,0x32,0x3F,0x3B,0x3E,0x3F,0x28,0x7A,0x3D,0x2F,0x3B,0x28,0x3E,0x29};
static const uint8_t _s26[] PROGMEM = {0x71,0x6B,0x6A,0x7A,0x37,0x35,0x28,0x3F,0x7A,0x39,0x36,0x3F,0x3B,0x34,0x2F,0x2A,0x7A,0x3C,0x33,0x22,0x3F,0x29};
static const uint8_t _s27[] PROGMEM = {0x77,0x77,0x77,0x7A,0x12,0x0D,0x7A,0x1C,0x13,0x02,0x1F,0x09,0x7A,0x0D,0x1F,0x7A,0x1C,0x15,0x0F,0x14,0x1E,0x7A,0x77,0x77,0x77};
static const uint8_t _s28[] PROGMEM = {0x1D,0x1E,0x15,0x6A,0x75,0x1D,0x1E,0x15,0x68,0x7A,0x0E,0x02,0x75,0x08,0x02,0x7A,0x09,0x0D,0x1B,0x0A,0x0A,0x1F,0x1E};
static const uint8_t _s29[] PROGMEM = {0x1C,0x13,0x02,0x1F,0x1E};
static const uint8_t _s30[] PROGMEM = {0x14,0x08,0x1C,0x68,0x6E,0x7A,0x2A,0x33,0x34,0x7A,0x39,0x35,0x34,0x3C,0x36,0x33,0x39,0x2E};
static const uint8_t _s31[] PROGMEM = {0x0C,0x68,0x7A,0x2A,0x33,0x34,0x7A,0x37,0x3B,0x2A,0x2A,0x33,0x34,0x3D,0x29,0x7A,0x3C,0x33,0x3D,0x2F,0x28,0x3F,0x3E,0x7A,0x35,0x2F,0x2E};
static const uint8_t _s32[] PROGMEM = {0x09,0x19,0x08,0x1F,0x1F,0x14,0x05,0x12,0x1F,0x13,0x1D,0x12,0x0E,0x7A,0x6C,0x6E,0x77,0x64,0x69,0x68,0x6A};
static const uint8_t _s33[] PROGMEM = {0x1B,0x2E,0x2E,0x28,0x33,0x38,0x2F,0x2E,0x33,0x35,0x34,0x7A,0x3D,0x33,0x2C,0x3F,0x34,0x60};
static const uint8_t _s34[] PROGMEM = {0x00,0x1F,0x08,0x15,0x74,0x7A,0x14,0x15,0x14,0x1F,0x74};
static const uint8_t _s35[] PROGMEM = {0x08,0x3F,0x37,0x3F,0x37,0x38,0x3F,0x28,0x74,0x7A,0x13,0x7A,0x38,0x2F,0x33,0x36,0x2E,0x7A,0x2E,0x32,0x33,0x29,0x74};
static const uint8_t _s36[] PROGMEM = {0x18,0x1B,0x19,0x11,0x7A,0x0E,0x15,0x7A,0x1F,0x02,0x13,0x0E,0x7A,0x7A,0x01,0x68,0x75,0x68,0x07};

void _svcRenderDiag() {
    tft.fillScreen(TFT_BLACK);
    tft.drawBitmap(0, 0, skull_bg_bitmap, SKULL_BG_WIDTH, SKULL_BG_HEIGHT, 0xA800);
    tft.drawRect(2, 2, SCREEN_WIDTH - 4, SCREEN_HEIGHT - 4, WONTHOUND_HOTPINK);
    tft.drawRect(4, 4, SCREEN_WIDTH - 8, SCREEN_HEIGHT - 8, WONTHOUND_VIOLET);
    tft.drawLine(0, 19, SCREEN_WIDTH, 19, WONTHOUND_MAGENTA);
    tft.fillRect(0, 20, SCREEN_WIDTH, 16, WONTHOUND_DARK);
    tft.drawBitmap(10, 20, bitmap_icon_go_back, 16, 16, WONTHOUND_MAGENTA);
    tft.drawLine(0, 36, SCREEN_WIDTH, 36, WONTHOUND_HOTPINK);
}

