Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
void _svcDiagA() {
    char _b[32];
    _svcRenderDiag();
    _xd(_b, _s1, sizeof(_s1)); drawGlitchTitle(48, _b);

    tft.setTextSize(1);
    int y = 68;

    tft.setTextColor(WONTHOUND_HOTPINK);
    tft.setCursor(18, y);
    _xd(_b, _s3, sizeof(_s3)); tft.print(_b);
    y += 18;

    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(10, y); _xd(_b, _s4, sizeof(_s4)); tft.print(_b);
    y += 13;
    tft.setCursor(10, y); _xd(_b, _s5, sizeof(_s5)); tft.print(_b);
    y += 16;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s6, sizeof(_s6)); tft.print(_b);
    y += 16;

    tft.setTextColor(WONTHOUND_HOTPINK);
    tft.setCursor(10, y); _xd(_b, _s7, sizeof(_s7)); tft.print(_b);
    y += 13;
    tft.setCursor(10, y); _xd(_b, _s8, sizeof(_s8)); tft.print(_b);
    y += 20;

    tft.setTextColor(WONTHOUND_VIOLET);
    tft.setCursor(10, y); _xd(_b, _s9, sizeof(_s9)); tft.print(_b);
    y += 14;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s10, sizeof(_s10)); tft.print(_b);
    y += 12;
    tft.setCursor(10, y); _xd(_b, _s11, sizeof(_s11)); tft.print(_b);
    y += 12;
    tft.setCursor(10, y); _xd(_b, _s12, sizeof(_s12)); tft.print(_b);
    y += 12;
    tft.setCursor(10, y); _xd(_b, _s13, sizeof(_s13)); tft.print(_b);
    y += 12;
    tft.setCursor(10, y); _xd(_b, _s14, sizeof(_s14)); tft.print(_b);
    y += 12;
    tft.setCursor(10, y); _xd(_b, _s15, sizeof(_s15)); tft.print(_b);
    y += 12;
    tft.setCursor(10, y); _xd(_b, _s16, sizeof(_s16)); tft.print(_b);
    y += 18;

    tft.setTextColor(WONTHOUND_GUNMETAL);
    tft.setCursor(50, 305);
    _xd(_b, _s17, sizeof(_s17)); tft.print(_b);
}

void _svcDiagB() {
    char _b[32];
    _svcRenderDiag();
    _xd(_b, _s2, sizeof(_s2)); drawGlitchTitle(48, _b);

    tft.setTextSize(2);
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, 68);
    _xd(_b, _s18, sizeof(_s18)); tft.print(_b);

    tft.setTextSize(1);
    int y = 88;

    tft.setTextColor(WONTHOUND_VIOLET);
    tft.setCursor(10, y); _xd(_b, _s19, sizeof(_s19)); tft.print(_b);
    y += 14;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s20, sizeof(_s20)); tft.print(_b);
    tft.setTextColor(WONTHOUND_HOTPINK);
    tft.setCursor(190, y); _xd(_b, _s21, sizeof(_s21)); tft.print(_b);
    y += 12;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s22, sizeof(_s22)); tft.print(_b);
    tft.setTextColor(WONTHOUND_HOTPINK);
    tft.setCursor(190, y); _xd(_b, _s21, sizeof(_s21)); tft.print(_b);
    y += 12;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s23, sizeof(_s23)); tft.print(_b);
    tft.setTextColor(WONTHOUND_HOTPINK);
    tft.setCursor(190, y); _xd(_b, _s21, sizeof(_s21)); tft.print(_b);
    y += 12;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s24, sizeof(_s24)); tft.print(_b);
    tft.setTextColor(WONTHOUND_HOTPINK);
    tft.setCursor(190, y); _xd(_b, _s21, sizeof(_s21)); tft.print(_b);
    y += 12;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s25, sizeof(_s25)); tft.print(_b);
    tft.setTextColor(WONTHOUND_HOTPINK);
    tft.setCursor(190, y); _xd(_b, _s21, sizeof(_s21)); tft.print(_b);
    y += 12;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s26, sizeof(_s26)); tft.print(_b);
    y += 18;

    tft.setTextColor(WONTHOUND_VIOLET);
    tft.setCursor(10, y); _xd(_b, _s27, sizeof(_s27)); tft.print(_b);
    y += 14;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s28, sizeof(_s28)); tft.print(_b);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(170, y); _xd(_b, _s29, sizeof(_s29)); tft.print(_b);
    y += 12;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s30, sizeof(_s30)); tft.print(_b);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(170, y); _xd(_b, _s29, sizeof(_s29)); tft.print(_b);
    y += 12;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s31, sizeof(_s31)); tft.print(_b);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(170, y); _xd(_b, _s29, sizeof(_s29)); tft.print(_b);
    y += 12;

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, y); _xd(_b, _s32, sizeof(_s32)); tft.print(_b);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(170, y); _xd(_b, _s29, sizeof(_s29)); tft.print(_b);
    y += 18;

    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(10, y); _xd(_b, _s33, sizeof(_s33)); tft.print(_b);
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(130, y); _xd(_b, _s34, sizeof(_s34)); tft.print(_b);
    y += 18;

    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(18, y);
    _xd(_b, _s35, sizeof(_s35)); tft.print(_b);

    tft.setTextColor(WONTHOUND_GUNMETAL);
    tft.setCursor(68, 305);
    _xd(_b, _s36, sizeof(_s36)); tft.print(_b);
}

void _svcRunDiag() {
    int page = 1;
    _svcDiagA();

    while (true) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) break;

        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty)) {
            if (ty > 36) {
                if (page == 1) {
                    page = 2;
                    _svcDiagB();
                } else {
                    page = 1;
                    _svcDiagA();
                }
                delay(300);
            }
        }

        delay(50);
    }
}

void displayDeviceInfo() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();

    drawGlitchTitle(70, "DEV INFO");

    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setTextSize(1);
    int y = 75;

    tft.setCursor(10, y); tft.print("Device: " FW_DEVICE);
    y += 18;
    tft.setCursor(10, y); tft.print("Version: " FW_FULL_VERSION);
    y += 18;
    tft.setCursor(10, y); tft.print("Port By Wontfallo");
    y += 18;
    tft.setCursor(10, y); tft.print("Based on ESP32-DIV (forked)");
    y += 18;
    tft.setCursor(10, y); tft.printf("Free Heap: %d", ESP.getFreeHeap());
    y += 18;
    tft.setCursor(10, y); tft.printf("CPU Freq: %dMHz", ESP.getCpuFreqMHz());
    y += 18;
    tft.setCursor(10, y); tft.printf("Flash: %dMB", ESP.getFlashChipSize() / 1024 / 1024);
    y += 18;
    tft.setCursor(10, y); tft.print("Board: " CYD_BOARD_NAME);
    y += 18;

    tft.setTextColor(WONTHOUND_VIOLET);
    tft.setCursor(10, y + 15);
    tft.print("GitHub: github.com/wontfallo");

