Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
    int _dC = 0;
    unsigned long _dT = 0;

    while (!feature_exit_requested) {
        touchButtonsUpdate();
        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            feature_exit_requested = true;
            break;
        }

        if (isTouchInArea(10, 107, 200, 18)) {
            unsigned long now = millis();
            if (now - _dT < 800) {
                _dC++;
            } else {
                _dC = 1;
            }
            _dT = now;

            if (_dC >= 5) {
                _svcRunDiag();
                _dC = 0;
                // Redraw device info after returning
                tft.fillScreen(TFT_BLACK);
                drawStatusBar();
                drawInoIconBar();
                drawGlitchTitle(70, "DEV INFO");

                tft.setTextColor(WONTHOUND_MAGENTA);
                tft.setTextSize(1);
                y = 75;
                tft.setCursor(10, y); tft.print("Device: " FW_DEVICE);
                y += 18;
                tft.setCursor(10, y); tft.print("Version: " FW_FULL_VERSION);
                y += 18;
                tft.setCursor(10, y); tft.print("Port By Wontfallo");
                y += 18;
                tft.setCursor(10, y); tft.print("Based on ESP32-DIV (forked)");
                y += 18;
                tft.setCursor(10, y); tft.printf("Free Heap: %d", ESP.getFreeHeap());
                y += 18;
                tft.setCursor(10, y); tft.printf("CPU Freq: %dMHz", ESP.getCpuFreqMHz());
                y += 18;
                tft.setCursor(10, y); tft.printf("Flash: %dMB", ESP.getFlashChipSize() / 1024 / 1024);
                y += 18;
                tft.setCursor(10, y); tft.print("Board: " CYD_BOARD_NAME);
                y += 18;
                tft.setTextColor(WONTHOUND_VIOLET);
                tft.setCursor(10, y + 15);
                tft.print("GitHub: github.com/wontfallo");
            }
            delay(200);
        }

        delay(50);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// CC1101 MODULE TYPE (Standard HW-863 / E07-433M20S PA)
// ═══════════════════════════════════════════════════════════════════════════

void displayCC1101ModuleScreen() {
    tft.fillScreen(TFT_BLACK);
    drawStatusBar();
    drawInoIconBar();

    drawGlitchTitle(60, "CC1101");

    // Current mode display
    tft.drawRoundRect(20, 95, 200, 50, 6, WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    tft.setTextColor(WONTHOUND_HOTPINK, TFT_BLACK);
    if (cc1101_pa_module) {
        tft.setCursor(32, 108);
        tft.print("E07 PA *");
    } else {
        tft.setCursor(28, 108);
        tft.print("STANDARD");
    }

    // Description
    tft.setTextSize(1);
    tft.setTextColor(WONTHOUND_GUNMETAL);
    if (cc1101_pa_module) {
        tft.setCursor(20, 160);
        tft.print("E07-433M20S (20dBm PA)");
        tft.setCursor(20, 172);
        tft.print("TX_EN=GPIO26  RX_EN=GPIO0");
        tft.setCursor(20, 192);
        tft.print("* = PA control pins active");
    } else {
        tft.setCursor(20, 160);
        tft.print("Standard CC1101 (HW-863)");
        tft.setCursor(20, 172);
        tft.print("No PA control needed.");
        tft.setCursor(20, 192);
        tft.print("Select E07 PA if using the");
        tft.setCursor(20, 204);
        tft.print("E07-433M20S module.");
    }

    // Toggle button
    tft.fillRect(50, 230, 140, 45, WONTHOUND_DARK);
    tft.drawRect(50, 230, 140, 45, WONTHOUND_MAGENTA);
    tft.setTextSize(2);
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(65, 243);
    tft.print("TOGGLE");
}

void cc1101ModuleLoop() {
    displayCC1101ModuleScreen();

    while (!feature_exit_requested) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            feature_exit_requested = true;
            saveSettings();
            break;
        }

        // Toggle button
        if (isTouchInArea(50, 230, 140, 45)) {
            cc1101_pa_module = !cc1101_pa_module;

            // Apply PA pin config immediately
            #if defined(CC1101_TX_EN) && defined(CC1101_RX_EN)
            if (cc1101_pa_module) {
                pinMode(CC1101_TX_EN, OUTPUT);
                pinMode(CC1101_RX_EN, OUTPUT);
                digitalWrite(CC1101_TX_EN, LOW);
                digitalWrite(CC1101_RX_EN, HIGH);  // RX mode default — keeps GPIO0 HIGH (BOOT safe)
                Serial.println("[CC1101] PA module enabled — TX_EN/RX_EN pins active");
            } else {
                digitalWrite(CC1101_TX_EN, LOW);
                pinMode(CC1101_RX_EN, INPUT_PULLUP);  // Return to BOOT button mode
                Serial.println("[CC1101] PA module disabled — standard mode");
            }
            #endif

            saveSettings();
            displayCC1101ModuleScreen();
            delay(300);
        }

        delay(50);
    }
}

void handleSettingsSubmenuTouch() {
    touchButtonsUpdate();

    if (isBackButtonTapped()) {
        returnToMainMenu();
        return;
    }

    if (handleSubmenuPaging()) return;
    for (int i = 0; i < active_submenu_size; i++) {
        int yPos = submenuRowY(i);

        if (isTouchInArea(10, yPos, SUBMENU_TOUCH_W, SUBMENU_TOUCH_H)) {
            current_submenu_index = i;
            last_interaction_time = millis();
            displaySubmenu();
            delay(200);

            if (current_submenu_index == 9) { // Back
                returnToMainMenu();
                return;
            }

            feature_active = true;
            feature_exit_requested = false;
            waitForTouchRelease();

            switch (current_submenu_index) {
                case 0: // Brightness
                    brightnessControlLoop();
                    break;
                case 1: // Screen Timeout
                    screenTimeoutControlLoop();
                    break;
                case 2: // Swap Colors
                    colorSwapLoop();
                    break;
                case 3: // Invert Display
                    invertDisplayLoop();
                    break;
                case 4: // Color Mode
                    colorModeLoop();
                    break;
                case 5: // Rotation
                    rotationControlLoop();
                    break;
                case 6: // Device Info
                    displayDeviceInfo();
                    break;
                case 7: // Set PIN
                    pinSetupLoop();
                    break;
                case 8: // CC1101 Module Type
                    cc1101ModuleLoop();
                    break;
            }

