Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
            returnToSubmenu();
            break;
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// ABOUT PAGE HANDLER
// My full-screen about page — skull watermark, glitch title, armed modules
// ═══════════════════════════════════════════════════════════════════════════

void handleAboutPage() {
    // I draw my full-screen about page — same visual punch as my splash screen
    tft.fillScreen(TFT_BLACK);

    // Skull watermark — dark cyan, same as my splash screen
    tft.drawBitmap(0, 0, skull_bg_bitmap, SKULL_BG_WIDTH, SKULL_BG_HEIGHT, 0x2945);

    // My double border — WontHound signature
    tft.drawRect(2, 2, SCREEN_WIDTH - 4, SCREEN_HEIGHT - 4, WONTHOUND_VIOLET);
    tft.drawRect(4, 4, SCREEN_WIDTH - 8, SCREEN_HEIGHT - 8, WONTHOUND_MAGENTA);

    // Icon bar with back button
    tft.drawLine(0, 19, SCREEN_WIDTH, 19, WONTHOUND_MAGENTA);
    tft.fillRect(0, 20, SCREEN_WIDTH, 16, WONTHOUND_DARK);
    tft.drawBitmap(10, 20, bitmap_icon_go_back, 16, 16, WONTHOUND_MAGENTA);
    tft.drawLine(0, 36, SCREEN_WIDTH, 36, WONTHOUND_HOTPINK);

    // Glitch title — chromatic aberration effect
    drawGlitchTitle(58, "WONTHOUND");

    // Subtitle — shows CYD or CYD-HAT
    drawGlitchStatus(80, FW_EDITION, WONTHOUND_MAGENTA);

    // Version centered
    drawCenteredText(90, FW_VERSION, WONTHOUND_VIOLET, 1);

    // Separator
    tft.drawLine(20, 100, SCREEN_WIDTH - 20, 100, WONTHOUND_VIOLET);

    // Armed modules section header
    tft.setTextSize(1);
    tft.setTextColor(WONTHOUND_HOTPINK);
    tft.setCursor(10, 106);
    tft.print("ARMED:");

    // Module grid — 2 columns showing what I've got loaded
    int my = 118;
    int col1 = 15;
    int col2 = 125;
    int rowH = 13;

    tft.setTextColor(WONTHOUND_MAGENTA);

    tft.setCursor(col1, my); tft.print("> WiFi");
    tft.setCursor(col2, my); tft.print("> Bluetooth");
    my += rowH;
    tft.setCursor(col1, my); tft.print("> SubGHz");
    tft.setCursor(col2, my); tft.print("> NRF24");
    my += rowH;
    tft.setCursor(col1, my); tft.print("> SIGINT");
    tft.setCursor(col2, my); tft.print("> GPS");
    my += rowH;
    tft.setCursor(col1, my); tft.print("> SD Card");
    tft.setCursor(col2, my); tft.print("> Serial Mon");

    // Separator
    my += rowH + 6;
    tft.drawLine(20, my, SCREEN_WIDTH - 20, my, WONTHOUND_VIOLET);
    my += 8;

    // System section header
    tft.setTextColor(WONTHOUND_HOTPINK);
    tft.setCursor(10, my);
    tft.print("SYSTEM:");
    my += 14;

    // Live hardware stats
    tft.setTextColor(WONTHOUND_MAGENTA);
    tft.setCursor(col1, my);
    tft.printf("Heap: %d bytes", ESP.getFreeHeap());
    my += 12;
    tft.setCursor(col1, my);
    tft.printf("CPU: %dMHz  Flash: %dMB", ESP.getCpuFreqMHz(), ESP.getFlashChipSize() / 1024 / 1024);
    my += 12;
    tft.setCursor(col1, my);
    tft.print("Board: " CYD_BOARD_NAME);

    // Separator
    my += 18;
    tft.drawLine(20, my, SCREEN_WIDTH - 20, my, WONTHOUND_VIOLET);
    my += 10;

    // Author — ported firmware
    drawCenteredText(my, "Port By Wontfallo", WONTHOUND_MAGENTA, 1);
    my += 14;
    drawCenteredText(my, "github.com/wontfallo", WONTHOUND_VIOLET, 1);

    // Tagline at the bottom
    drawCenteredText(SCREEN_HEIGHT - 18, "I built this.", WONTHOUND_GUNMETAL, 1);

    // My own event loop — I stay here until back is pressed
    while (true) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            break;
        }

        delay(50);
    }

    returnToMainMenu();
}

// ═══════════════════════════════════════════════════════════════════════════
// PIN LOCK SCREEN - Blocks until correct PIN entered
// ═══════════════════════════════════════════════════════════════════════════

void showPinLockScreen() {
    // Numpad layout: 3 columns x 4 rows — big touch-friendly buttons
    // [1] [2] [3]
    // [4] [5] [6]
    // [7] [8] [9]
    // [CLR] [0] [OK]
    const int btnW = 68;                                        // Wide buttons
    const int btnH = 38;                                        // Tall enough to tap
    const int gapX = 4;                                         // Tight horizontal gaps
    const int gapY = 4;                                         // Tight vertical gaps
    const int padX = (SCREEN_WIDTH - (3 * btnW + 2 * gapX)) / 2;  // Auto-center horizontally
    const int padY = 138;                                       // Below digit boxes
    const char* labels[12] = {"1","2","3","4","5","6","7","8","9","CLR","0","OK"};

    // Digit box layout — 4 individual boxes centered
    const int boxW = 36;
    const int boxH = 40;
    const int boxGap = 10;
    const int boxTotalW = 4 * boxW + 3 * boxGap;
    const int boxStartX = (SCREEN_WIDTH - boxTotalW) / 2;
    const int boxY = 68;

    uint8_t entered[4] = {0, 0, 0, 0};
    int digitCount = 0;

    auto drawDigitBoxes = [&]() {
        for (int d = 0; d < 4; d++) {
            int bx = boxStartX + d * (boxW + boxGap);
            // Clear box interior
            tft.fillRoundRect(bx, boxY, boxW, boxH, 4, WONTHOUND_DARK);
            // Box border — highlight filled ones
            if (d < digitCount) {
                tft.drawRoundRect(bx, boxY, boxW, boxH, 4, WONTHOUND_HOTPINK);
            } else {
                tft.drawRoundRect(bx, boxY, boxW, boxH, 4, WONTHOUND_MAGENTA);
            }
            // Character — star or underscore
            tft.setTextSize(3);
            tft.setTextColor(WONTHOUND_HOTPINK);
            int charW = 18;  // textSize 3 char width
            tft.setCursor(bx + (boxW - charW) / 2, boxY + 10);
            tft.print(d < digitCount ? "*" : "_");
        }
    };

    auto drawPinScreen = [&]() {
        tft.fillScreen(TFT_BLACK);

        // Skull watermark — very dark, subtle
        tft.drawBitmap(0, 0, skull_bg_bitmap, SKULL_BG_WIDTH, SKULL_BG_HEIGHT, 0x1841);

        // Double border — WontHound signature
        tft.drawRect(2, 2, SCREEN_WIDTH - 4, SCREEN_HEIGHT - 4, WONTHOUND_VIOLET);
        tft.drawRect(4, 4, SCREEN_WIDTH - 8, SCREEN_HEIGHT - 8, WONTHOUND_MAGENTA);

