Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
        // LOCKED title — Nosifer glitch
        drawGlitchTitle(48, "LOCKED");

        // Separator line below title
        tft.drawLine(20, 55, SCREEN_WIDTH - 20, 55, WONTHOUND_VIOLET);

        // 4 digit boxes
        drawDigitBoxes();

        // Separator above numpad
        tft.drawLine(20, boxY + boxH + 10, SCREEN_WIDTH - 20, boxY + boxH + 10, WONTHOUND_VIOLET);

        // Draw numpad buttons
        for (int i = 0; i < 12; i++) {
            int col = i % 3;
            int row = i / 3;
            int bx = padX + col * (btnW + gapX);
            int by = padY + row * (btnH + gapY);

            // CLR and OK get different styling
            if (i == 9 || i == 11) {
                tft.fillRoundRect(bx, by, btnW, btnH, 5, WONTHOUND_DARK);
                tft.drawRoundRect(bx, by, btnW, btnH, 5, WONTHOUND_VIOLET);
                tft.setTextSize(1);
                tft.setTextColor(WONTHOUND_MAGENTA);
                int tw = strlen(labels[i]) * 6;
                tft.setCursor(bx + (btnW - tw) / 2, by + 15);
                tft.print(labels[i]);
            } else {
                tft.fillRoundRect(bx, by, btnW, btnH, 5, WONTHOUND_DARK);
                tft.drawRoundRect(bx, by, btnW, btnH, 5, WONTHOUND_MAGENTA);
                // Single digit — center with textSize 2
                tft.setTextSize(2);
                tft.setTextColor(WONTHOUND_HOTPINK);
                int tw = 12;  // One char at textSize 2
                tft.setCursor(bx + (btnW - tw) / 2, by + 11);
                tft.print(labels[i]);
            }
        }
    };

    drawPinScreen();

    while (true) {
        touchButtonsUpdate();

        if (!isTouched()) {
            delay(30);
            continue;
        }

        // Check which button was tapped
        bool tapped = false;
        for (int i = 0; i < 12; i++) {
            int col = i % 3;
            int row = i / 3;
            int bx = padX + col * (btnW + gapX);
            int by = padY + row * (btnH + gapY);

            if (isTouchInArea(bx, by, btnW, btnH)) {
                tapped = true;

                if (i == 9) {
                    // CLR — clear all entered digits
                    digitCount = 0;
                    drawDigitBoxes();
                } else if (i == 11) {
                    // OK — verify PIN
                    if (digitCount == 4) {
                        uint16_t enteredPin = entered[0] * 1000 + entered[1] * 100 + entered[2] * 10 + entered[3];
                        if (enteredPin == device_pin) {
                            // Correct — unlock and return
                            device_locked = false;
                            return;
                        } else {
                            // Wrong PIN — flash red, shake effect
                            for (int flash = 0; flash < 3; flash++) {
                                for (int d = 0; d < 4; d++) {
                                    int fbx = boxStartX + d * (boxW + boxGap);
                                    tft.drawRoundRect(fbx, boxY, boxW, boxH, 4, TFT_RED);
                                }
                                delay(100);
                                for (int d = 0; d < 4; d++) {
                                    int fbx = boxStartX + d * (boxW + boxGap);
                                    tft.drawRoundRect(fbx, boxY, boxW, boxH, 4, WONTHOUND_DARK);
                                }
                                delay(100);
                            }
                            digitCount = 0;
                            drawDigitBoxes();
                        }
                    }
                } else {
                    // Digit button (0-9)
                    if (digitCount < 4) {
                        int digit = (i == 10) ? 0 : (i + 1);
                        entered[digitCount] = digit;
                        digitCount++;
                        // Redraw just the digit boxes
                        drawDigitBoxes();
                    }
                }
                break;
            }
        }

        if (tapped) {
            delay(200);  // Debounce
        }
    }
}

// Helper: PIN entry screen used by pinSetupLoop — returns entered 4-digit PIN, or -1 if cancelled
int pinEntryScreen(const char* title) {
    // Layout: icon bar (0-36) → title → digit boxes → numpad → bottom
    // All auto-centered on 240px width

    // Numpad buttons — readable digits, good touch targets
    const int btnW = 66;
    const int btnH = 40;
    const int gapX = 6;
    const int gapY = 4;
    const int padX = (SCREEN_WIDTH - (3 * btnW + 2 * gapX)) / 2;
    const int padY = 128;
    const char* labels[12] = {"1","2","3","4","5","6","7","8","9","CLR","0","OK"};

    // 4 digit boxes
    const int boxW = 32;
    const int boxH = 34;
    const int boxGap = 10;
    const int boxTotalW = 4 * boxW + 3 * boxGap;
    const int boxStartX = (SCREEN_WIDTH - boxTotalW) / 2;
    const int boxY = 76;

    uint8_t entered[4] = {0, 0, 0, 0};
    int digitCount = 0;

    auto drawDigitBoxes = [&]() {
        for (int d = 0; d < 4; d++) {
            int bx = boxStartX + d * (boxW + boxGap);
            tft.fillRoundRect(bx, boxY, boxW, boxH, 4, WONTHOUND_DARK);
            tft.drawRoundRect(bx, boxY, boxW, boxH, 4,
                d < digitCount ? WONTHOUND_HOTPINK : WONTHOUND_MAGENTA);
            // Star or underscore — textSize 2, centered in box
            tft.setTextSize(2);
            tft.setTextColor(WONTHOUND_HOTPINK);
            tft.setCursor(bx + (boxW - 12) / 2, boxY + 9);
            tft.print(d < digitCount ? "*" : "_");
        }
    };

    auto drawScreen = [&]() {
        tft.fillScreen(TFT_BLACK);
        drawInoIconBar();

        // Title — plain text, centered, clean
        tft.setTextSize(1);
        tft.setTextColor(WONTHOUND_HOTPINK);
        int tw = strlen(title) * 6;
        tft.setCursor((SCREEN_WIDTH - tw) / 2, 44);
        tft.print(title);

        // Separator below title
        tft.drawLine(30, 56, SCREEN_WIDTH - 30, 56, WONTHOUND_VIOLET);

