Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
        // Hint text
        tft.setTextSize(1);
        tft.setTextColor(WONTHOUND_GUNMETAL);
        const char* hint = "Enter 4-digit PIN";
        int hw = strlen(hint) * 6;
        tft.setCursor((SCREEN_WIDTH - hw) / 2, 62);
        tft.print(hint);

        // 4 digit boxes
        drawDigitBoxes();

        // Separator above numpad
        tft.drawLine(30, boxY + boxH + 6, SCREEN_WIDTH - 30, boxY + boxH + 6, WONTHOUND_VIOLET);

        // Numpad buttons
        for (int i = 0; i < 12; i++) {
            int col = i % 3;
            int row = i / 3;
            int bx = padX + col * (btnW + gapX);
            int by = padY + row * (btnH + gapY);

            if (i == 9 || i == 11) {
                // CLR / OK — violet accent, textSize 1
                tft.fillRoundRect(bx, by, btnW, btnH, 5, WONTHOUND_DARK);
                tft.drawRoundRect(bx, by, btnW, btnH, 5, WONTHOUND_VIOLET);
                tft.setTextSize(1);
                tft.setTextColor(WONTHOUND_MAGENTA);
                int ltw = strlen(labels[i]) * 6;
                tft.setCursor(bx + (btnW - ltw) / 2, by + 16);
                tft.print(labels[i]);
            } else {
                // Digit buttons — textSize 2 for readable numbers
                tft.fillRoundRect(bx, by, btnW, btnH, 5, WONTHOUND_DARK);
                tft.drawRoundRect(bx, by, btnW, btnH, 5, WONTHOUND_MAGENTA);
                tft.setTextSize(2);
                tft.setTextColor(WONTHOUND_HOTPINK);
                tft.setCursor(bx + (btnW - 12) / 2, by + 12);
                tft.print(labels[i]);
            }
        }
    };

    drawScreen();

    while (true) {
        touchButtonsUpdate();

        // Back button — cancel
        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            return -1;
        }

        if (!isTouched()) {
            delay(30);
            continue;
        }

        bool tapped = false;
        for (int i = 0; i < 12; i++) {
            int col = i % 3;
            int row = i / 3;
            int bx = padX + col * (btnW + gapX);
            int by = padY + row * (btnH + gapY);

            if (isTouchInArea(bx, by, btnW, btnH)) {
                tapped = true;

                if (i == 9) {
                    digitCount = 0;
                    drawDigitBoxes();
                } else if (i == 11) {
                    if (digitCount == 4) {
                        return entered[0] * 1000 + entered[1] * 100 + entered[2] * 10 + entered[3];
                    }
                } else {
                    if (digitCount < 4) {
                        int digit = (i == 10) ? 0 : (i + 1);
                        entered[digitCount] = digit;
                        digitCount++;
                        drawDigitBoxes();
                    }
                }
                break;
            }
        }

        if (tapped) {
            delay(200);
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// PIN SETUP LOOP - Settings menu handler for Set PIN
// ═══════════════════════════════════════════════════════════════════════════

void pinSetupLoop() {
    auto drawPinMenu = [&]() {
        tft.fillScreen(TFT_BLACK);
        drawStatusBar();
        drawInoIconBar();

        drawGlitchTitle(65, "SET PIN");

        // Separator
        tft.drawLine(20, 72, SCREEN_WIDTH - 20, 72, WONTHOUND_VIOLET);

        // Current status — small text, centered
        tft.setTextSize(1);
        tft.setTextColor(pin_enabled ? WONTHOUND_HOTPINK : WONTHOUND_GUNMETAL);
        const char* statusText = pin_enabled ? "PIN LOCK: ENABLED" : "PIN LOCK: DISABLED";
        int sw = strlen(statusText) * 6;
        tft.setCursor((SCREEN_WIDTH - sw) / 2, 82);
        tft.print(statusText);

        // Toggle button
        int btnY = 105;
        int btnW2 = SCREEN_WIDTH - 60;
        int btnX = 30;
        tft.fillRoundRect(btnX, btnY, btnW2, 32, 5, WONTHOUND_DARK);
        tft.drawRoundRect(btnX, btnY, btnW2, 32, 5, WONTHOUND_MAGENTA);
        tft.setTextSize(1);
        tft.setTextColor(WONTHOUND_HOTPINK);
        const char* toggleText = pin_enabled ? "DISABLE PIN" : "ENABLE PIN";
        int tw = strlen(toggleText) * 6;
        tft.setCursor(btnX + (btnW2 - tw) / 2, btnY + 12);
        tft.print(toggleText);

        // Change PIN button (only if enabled)
        if (pin_enabled) {
            int btn2Y = 150;
            tft.fillRoundRect(btnX, btn2Y, btnW2, 32, 5, WONTHOUND_DARK);
            tft.drawRoundRect(btnX, btn2Y, btnW2, 32, 5, WONTHOUND_MAGENTA);
            tft.setTextSize(1);
            tft.setTextColor(WONTHOUND_HOTPINK);
            const char* changeText = "CHANGE PIN";
            tw = strlen(changeText) * 6;
            tft.setCursor(btnX + (btnW2 - tw) / 2, btn2Y + 12);
            tft.print(changeText);
        }
    };

    drawPinMenu();

    while (!feature_exit_requested) {
        touchButtonsUpdate();

        if (isInoBackTapped() || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            feature_exit_requested = true;
            break;
        }

        int btnW2 = SCREEN_WIDTH - 60;

        // Toggle button
        if (isTouchInArea(30, 105, btnW2, 32)) {
            delay(200);

            if (pin_enabled) {
                // Disabling — verify current PIN first
                int entered = pinEntryScreen("VERIFY");
                if (entered == -1) {
                    drawPinMenu();
                    continue;
                }
                if ((uint16_t)entered == device_pin) {
                    pin_enabled = false;
                    device_pin = 0;
                    device_locked = false;
                    saveSettings();
                    drawPinMenu();
                } else {
                    tft.fillScreen(TFT_RED);
                    drawCenteredText(150, "WRONG PIN", TFT_WHITE, 1);
                    delay(600);
                    drawPinMenu();
                }
            } else {
                // Enabling — enter new PIN
                int newPin = pinEntryScreen("NEW PIN");
                if (newPin == -1) {
                    drawPinMenu();
                    continue;
                }

                // Confirm PIN
                int confirm = pinEntryScreen("CONFIRM");
                if (confirm == -1) {
                    drawPinMenu();
                    continue;
                }

                if (newPin == confirm) {
                    device_pin = (uint16_t)newPin;
                    pin_enabled = true;
                    saveSettings();
                    drawPinMenu();
                } else {
                    tft.fillScreen(TFT_RED);
                    drawCenteredText(150, "MISMATCH", TFT_WHITE, 1);
                    delay(600);
                    drawPinMenu();
                }
            }
            continue;
        }

        // Change PIN button (only active when enabled)
        if (pin_enabled && isTouchInArea(30, 150, btnW2, 32)) {
            delay(200);

