Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
            // Verify current PIN
            int current = pinEntryScreen("CURRENT");
            if (current == -1) {
                drawPinMenu();
                continue;
            }
            if ((uint16_t)current != device_pin) {
                tft.fillScreen(TFT_RED);
                drawCenteredText(150, "WRONG PIN", TFT_WHITE, 2);
                delay(600);
                drawPinMenu();
                continue;
            }

            // Enter new PIN
            int newPin = pinEntryScreen("NEW PIN");
            if (newPin == -1) {
                drawPinMenu();
                continue;
            }

            // Confirm
            int confirm = pinEntryScreen("CONFIRM");
            if (confirm == -1) {
                drawPinMenu();
                continue;
            }

            if (newPin == confirm) {
                device_pin = (uint16_t)newPin;
                saveSettings();
                drawPinMenu();
            } else {
                tft.fillScreen(TFT_RED);
                drawCenteredText(150, "MISMATCH", TFT_WHITE, 2);
                delay(600);
                drawPinMenu();
            }
            continue;
        }

        delay(50);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// LEGAL DISCLAIMER
// ═══════════════════════════════════════════════════════════════════════════

// Check if offensive functions are allowed
bool isOffensiveAllowed() {
    return true;
}

// ─── Legal Disclaimer Screen ────────────────────────────────────────────
// Returns true if user accepted, false if declined
bool showDisclaimerScreen() {
    disclaimer_accepted = true;
    return true;

    // Disclaimer text lines
    const char* disclaimerLines[] = {
        "This device contains offensive",
        "security tools. By proceeding",
        "you accept FULL personal",
        "liability for all actions.",
        "",
        "Unauthorized use of jamming,",
        "deauth, replay, and exploit",
        "tools violates federal law.",
        "",
        "Use ONLY on systems you own",
        "or have written permission",
        "to test.",
        "",
        "47 U.S.C. 333 - Jamming",
        "18 U.S.C. 1030 - CFAA",
        "",
        "YOU HAVE BEEN WARNED."
    };
    const int numLines = 17;
    const int visibleLines = 5;
    const int lineHeight = 12;
    int scrollOffset = 0;
    int maxScroll = numLines - visibleLines;
    if (maxScroll < 0) maxScroll = 0;

    // Text area Y bounds
    const int textAreaY = SCALE_Y(210);
    const int textAreaH = visibleLines * lineHeight;

    auto drawDisclaimerPage = [&]() {
        tft.fillScreen(TFT_BLACK);

        // Skull watermark — very dark
        tft.drawBitmap(0, 0, skull_bg_bitmap, SKULL_BG_WIDTH, SKULL_BG_HEIGHT, 0x1841);

        // Double border — violet outer, magenta inner
        tft.drawRect(2, 2, SCREEN_WIDTH - 4, SCREEN_HEIGHT - 4, WONTHOUND_VIOLET);
        tft.drawRect(4, 4, SCREEN_WIDTH - 8, SCREEN_HEIGHT - 8, WONTHOUND_MAGENTA);

        // Disclaimer skull centered at top
        int skullX = (SCREEN_WIDTH - 120) / 2;
        tft.drawBitmap(skullX, SCALE_Y(10), bitmap_disclaimer_skull, 120, 160, WONTHOUND_VIOLET);

        // Title — glitch Nosifer
        drawGlitchTitle(SCALE_Y(175), "LIABILITY");
        drawGlitchStatus(SCALE_Y(195), "DISCLAIMER", WONTHOUND_VIOLET);

        // Separator line
        tft.drawLine(20, SCALE_Y(205), SCREEN_WIDTH - 20, SCALE_Y(205), WONTHOUND_VIOLET);
    };

    auto drawTextArea = [&]() {
        // Clear text area
        tft.fillRect(8, textAreaY, SCREEN_WIDTH - 16, textAreaH, TFT_BLACK);

        tft.setTextSize(1);
        for (int i = 0; i < visibleLines && (scrollOffset + i) < numLines; i++) {
            int lineIdx = scrollOffset + i;
            const char* line = disclaimerLines[lineIdx];

            // Legal citations in violet, rest in magenta
            bool isCitation = (strstr(line, "U.S.C.") != NULL);
            bool isWarning = (strcmp(line, "YOU HAVE BEEN WARNED.") == 0);

            if (isCitation) {
                tft.setTextColor(WONTHOUND_VIOLET, TFT_BLACK);
            } else if (isWarning) {
                tft.setTextColor(WONTHOUND_HOTPINK, TFT_BLACK);
            } else {
                tft.setTextColor(WONTHOUND_MAGENTA, TFT_BLACK);
            }

            // Center each line
            int tw = strlen(line) * 6;
            int tx = (SCREEN_WIDTH - tw) / 2;
            if (tx < 8) tx = 8;
            tft.setCursor(tx, textAreaY + i * lineHeight);
            tft.print(line);
        }

        // Scroll indicator
        if (maxScroll > 0) {
            tft.setTextSize(1);
            tft.setTextColor(WONTHOUND_GUNMETAL, TFT_BLACK);
            if (scrollOffset < maxScroll) {
                tft.setCursor(SCREEN_WIDTH - 20, textAreaY + textAreaH - 10);
                tft.print("v");
            }
            if (scrollOffset > 0) {
                tft.setCursor(SCREEN_WIDTH - 20, textAreaY);
                tft.print("^");
            }
        }
    };

    // Button dimensions (shared between draw and touch)
    const int dBtnW = SCALE_W(95);
    const int dBtnH = SCALE_H(32);
    const int dBtnY = SCALE_Y(282);
    const int dAcceptX = SCALE_X(15);
    const int dDeclineX = SCREEN_WIDTH - dBtnW - SCALE_X(15);

    auto drawButtons = [&]() {
        // Separator above buttons
        tft.drawLine(20, SCALE_Y(275), SCREEN_WIDTH - 20, SCALE_Y(275), WONTHOUND_VIOLET);

        // ACCEPT button — left side
        tft.fillRoundRect(dAcceptX, dBtnY, dBtnW, dBtnH, 5, WONTHOUND_DARK);
        tft.drawRoundRect(dAcceptX, dBtnY, dBtnW, dBtnH, 5, WONTHOUND_MAGENTA);
        tft.setTextSize(1);
        tft.setTextColor(WONTHOUND_HOTPINK);
        tft.setCursor(dAcceptX + 20, dBtnY + (dBtnH - 8) / 2);
        tft.print("ACCEPT");

        // DECLINE button — right side
        tft.fillRoundRect(dDeclineX, dBtnY, dBtnW, dBtnH, 5, WONTHOUND_DARK);
        tft.drawRoundRect(dDeclineX, dBtnY, dBtnW, dBtnH, 5, WONTHOUND_GUNMETAL);
        tft.setTextSize(1);
        tft.setTextColor(WONTHOUND_GUNMETAL);
        tft.setCursor(dDeclineX + 15, dBtnY + (dBtnH - 8) / 2);
        tft.print("DECLINE");
    };

    drawDisclaimerPage();
    drawTextArea();
    drawButtons();

    // Auto-scroll timer
    unsigned long lastAutoScroll = millis();
    const unsigned long autoScrollInterval = 3000;  // 3 seconds per scroll

    while (true) {
        touchButtonsUpdate();

        // BOOT button = decline
        if (buttonPressed(BTN_BOOT)) {
            delay(200);
            return false;
        }

