Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
        // Auto-scroll
        if (maxScroll > 0 && scrollOffset < maxScroll) {
            if (millis() - lastAutoScroll > autoScrollInterval) {
                scrollOffset++;
                drawTextArea();
                lastAutoScroll = millis();
            }
        }

        // Touch handling
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty)) {
            consumeTouch();

            // ACCEPT button
            if (tx >= dAcceptX && tx <= dAcceptX + dBtnW && ty >= dBtnY && ty <= dBtnY + dBtnH) {
                // Flash button
                tft.fillRoundRect(dAcceptX, dBtnY, dBtnW, dBtnH, 5, WONTHOUND_MAGENTA);
                tft.setTextColor(TFT_WHITE);
                tft.setCursor(dAcceptX + 20, dBtnY + (dBtnH - 8) / 2);
                tft.print("ACCEPT");
                delay(300);

                disclaimer_accepted = true;
                saveSettings();
                return true;
            }

            // DECLINE button
            if (tx >= dDeclineX && tx <= dDeclineX + dBtnW && ty >= dBtnY && ty <= dBtnY + dBtnH) {
                delay(200);
                return false;
            }

            // Scroll down — tap bottom half of text area
            if (ty >= textAreaY && ty <= textAreaY + textAreaH) {
                if (ty > textAreaY + textAreaH / 2 && scrollOffset < maxScroll) {
                    scrollOffset++;
                    drawTextArea();
                    lastAutoScroll = millis();
                } else if (ty <= textAreaY + textAreaH / 2 && scrollOffset > 0) {
                    scrollOffset--;
                    drawTextArea();
                    lastAutoScroll = millis();
                }
                delay(200);
            }
        }

        delay(30);
    }
}

// (VALHALLA Protocol / Blue Team mode + SD-wipe removed — Wontfallo UI refresh)

// ═══════════════════════════════════════════════════════════════════════════
// MAIN BUTTON/TOUCH HANDLER
// ═══════════════════════════════════════════════════════════════════════════

void handleButtons() {
    pin_enabled = false;
    device_locked = false;

    // Screen sleep check — disabled while a feature is active (jammers, attacks, etc.)
    if (screen_timeout_seconds > 0 && !screen_asleep && !feature_active) {
        if (millis() - last_interaction_time > (unsigned long)screen_timeout_seconds * 1000) {
            setBacklightLevel(0);
            screen_asleep = true;
            if (pin_enabled) device_locked = true;
        }
    }

    // Wake on any touch or button press — eat the input
    if (screen_asleep) {
        touchButtonsUpdate();
        if (isTouched() || isBootButtonPressed()) {
            screen_asleep = false;
            setBacklightLevel((uint8_t)brightness_level);
            last_interaction_time = millis();
            if (device_locked) {
                showPinLockScreen();
                // Restore correct screen based on navigation state
                if (in_sub_menu) {
                    submenu_initialized = false;
                    displaySubmenu();
                } else {
                    menu_initialized = false;
                    displayMenu();
                }
            }
            delay(100);
        }
        return;
    }

    if (in_sub_menu) {
        switch (current_menu_index) {
            case 0: handleWiFiSubmenuTouch(); break;
            case 1: handleBluetoothSubmenuTouch(); break;
            case 2: handleNRFSubmenuTouch(); break;
            case 3: handleSubGHzSubmenuTouch(); break;
            case 4: handleRFIDSubmenuTouch(); break;
            case 5: handleJamDetectSubmenuTouch(); break;
            case 6: handleSIGINTSubmenuTouch(); break;
            case 7: handleToolsSubmenuTouch(); break;
            case 8: handleSettingsSubmenuTouch(); break;
            case 9: handleAboutPage(); break;
            default: break;
        }
    } else {
        // Home screen: fixed dashboard — every icon is a static hit-test rect, no
        // scrolling. Clean discrete taps suit the resistive panel and nothing
        // redraws on touch, so there is no flicker.
        touchButtonsUpdate();

        uint16_t tpx, tpy;
        if (peekTouchPoint(&tpx, &tpy)) {
            int startX = tpx, startY = tpy;
            last_interaction_time = millis();

            // Wait for release so each tap is one discrete event (debounce).
            while (isStillTouched()) delay(8);
            consumeTouch();

            // Lock icon (top-right)
            if (pin_enabled && startX >= SCREEN_WIDTH - 28 && startY >= 14 && startY <= 34) {
                device_locked = true;
                setBacklightLevel(0);
                screen_asleep = true;
                last_interaction_time = millis();
                return;
            }

            // Hit-test the 10 fixed icon rects, with touch padding for fat fingers.
            const int PAD = 8;
            for (int i = 0; i < NUM_MENU_ITEMS; i++) {
                int ix = HOME_ICON_XY[i][0], iy = HOME_ICON_XY[i][1];
                if (startX >= ix - PAD && startX <= ix + WH_ICON_W + PAD &&
                    startY >= iy - PAD && startY <= iy + WH_ICON_H + PAD) {
                    current_menu_index = i;
                    tft.drawRect(ix - 2, iy - 2, WH_ICON_W + 4, WH_ICON_H + 4, WONTHOUND_HOTPINK);  // tap flash
                    delay(60);
                    updateActiveSubmenu();
                    if (active_submenu_items && active_submenu_size > 0) {
                        current_submenu_index = 0;
                        in_sub_menu = true;
                        submenu_initialized = false;
                        displaySubmenu();
                    }
                    break;
                }
            }
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// SPLASH SCREEN
// ═══════════════════════════════════════════════════════════════════════════

void showSplash() {
    tft.fillScreen(WONTHOUND_BLACK);

#ifndef CYD_35
    // New background image (Anonymous bulb) on the 2.8" panel
    tft.setSwapBytes(true);
    tft.pushImage(0, 0, WONTHOUND_BG_W, WONTHOUND_BG_H, wonthound_bg);
    tft.setSwapBytes(false);
#endif

    // Draw border
    tft.drawRect(2, 2, SCREEN_WIDTH - 4, SCREEN_HEIGHT - 4, WONTHOUND_VIOLET);
    tft.drawRect(4, 4, SCREEN_WIDTH - 8, SCREEN_HEIGHT - 8, WONTHOUND_MAGENTA);

#ifdef CYD_35
    // Title — glitch effect (scaled for 480px height)
    drawGlitchTitle(120, "WONTHOUND");
    drawGlitchStatus(180, FW_EDITION, WONTHOUND_MAGENTA);
    tft.setTextSize(1);
    drawCenteredText(220, FW_VERSION, WONTHOUND_HOTPINK, 1);
    drawCenteredText(245, CYD_BOARD_NAME, WONTHOUND_HOTPINK, 1);
#else
    // Title raised toward the top; all other middle text removed so it doesn't
    // block/bleed over the background. Only the bottom credit + URL remain.
    drawGlitchTitle(38, "WONTHOUND");
#endif

    // Credits (small text at the very bottom)
    drawCenteredText(SCREEN_HEIGHT - 40, "Port By Wontfallo", WONTHOUND_VIOLET, 1);
    drawCenteredText(SCREEN_HEIGHT - 25, "github.com/wontfallo", WONTHOUND_VIOLET, 1);
}

// ═══════════════════════════════════════════════════════════════════════════
// BOOT DIAGNOSTICS — Shows radio/SPI status on TFT (works without serial)
// ═══════════════════════════════════════════════════════════════════════════

void runBootDiagnostics() {
    tft.fillScreen(TFT_BLACK);
    tft.setTextSize(1);
    int y = 5;

    // Title
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(30, y);
    tft.print("=== BOOT DIAGNOSTICS ===");
    y += 18;

