Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
    // SPI bus info
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setCursor(5, y);
    tft.printf("SPI Bus: SCK=%d MISO=%d MOSI=%d", VSPI_SCK, VSPI_MISO, VSPI_MOSI);
    y += 16;

    // ── NRF24 TEST ──────────────────────────────────────────────
    tft.setTextColor(TFT_CYAN, TFT_BLACK);
    tft.setCursor(5, y);
    tft.printf("NRF24: CE=%d CSN=%d", NRF24_CE, NRF24_CSN);
    y += 12;

    // Deselect all CS pins
    pinMode(SD_CS, OUTPUT);       digitalWrite(SD_CS, HIGH);
    pinMode(CC1101_CS, OUTPUT);   digitalWrite(CC1101_CS, HIGH);
    pinMode(NRF24_CSN, OUTPUT);   digitalWrite(NRF24_CSN, HIGH);
    pinMode(NRF24_CE, OUTPUT);    digitalWrite(NRF24_CE, LOW);

    // Fresh SPI init
    SPI.end();
    delay(10);
    SPI.begin(VSPI_SCK, VSPI_MISO, VSPI_MOSI);
    SPI.setFrequency(4000000);
    delay(10);

    // Try NRF24 STATUS register read — 3 attempts with increasing delays
    bool nrfFound = false;
    byte nrfStatus[3] = {0, 0, 0};
    int nrfDelays[] = {10, 100, 500};

    for (int attempt = 0; attempt < 3; attempt++) {
        delay(nrfDelays[attempt]);

        // NRF24 returns STATUS byte on first SPI transfer of any command
        digitalWrite(NRF24_CSN, LOW);
        delayMicroseconds(5);
        nrfStatus[attempt] = SPI.transfer(0x07);
        SPI.transfer(0xFF);
        digitalWrite(NRF24_CSN, HIGH);

        if (nrfStatus[attempt] != 0x00 && nrfStatus[attempt] != 0xFF) {
            nrfFound = true;
        }
    }

    // Show raw STATUS bytes from all 3 attempts
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setCursor(5, y);
    tft.printf("  RAW: 0x%02X  0x%02X  0x%02X", nrfStatus[0], nrfStatus[1], nrfStatus[2]);
    y += 12;

    tft.setCursor(5, y);
    if (nrfFound) {
        tft.setTextColor(TFT_GREEN, TFT_BLACK);
        tft.print("  >> NRF24 DETECTED");
        for (int i = 0; i < 3; i++) {
            if (nrfStatus[i] != 0x00 && nrfStatus[i] != 0xFF) {
                tft.printf(" (try %d +%dms)", i + 1, nrfDelays[i]);
                break;
            }
        }
    } else {
        tft.setTextColor(TFT_RED, TFT_BLACK);
        tft.print("  >> NRF24 NOT FOUND");
    }
    y += 18;

    // ── CC1101 TEST ─────────────────────────────────────────────
    tft.setTextColor(TFT_CYAN, TFT_BLACK);
    tft.setCursor(5, y);
    tft.printf("CC1101: CS=%d GDO0=%d GDO2=%d", CC1101_CS, CC1101_GDO0, CC1101_GDO2);
    y += 12;

    // Reset SPI for ELECHOUSE library
    SPI.end();
    delay(10);

    // Deselect NRF24 before CC1101 test
    pinMode(NRF24_CSN, OUTPUT);
    digitalWrite(NRF24_CSN, HIGH);
    pinMode(SD_CS, OUTPUT);
    digitalWrite(SD_CS, HIGH);

    // Safe CC1101 check — ELECHOUSE library has blocking while(MISO)
    // loops that freeze forever if no CC1101 is connected
    bool cc1101Found = false;
    if (cc1101SafeCheck()) {
        ELECHOUSE_cc1101.setSpiPin(VSPI_SCK, VSPI_MISO, VSPI_MOSI, CC1101_CS);
        ELECHOUSE_cc1101.setGDO(CC1101_GDO0, CC1101_GDO2);
        cc1101Found = ELECHOUSE_cc1101.getCC1101();
    }

    tft.setCursor(5, y);
    if (cc1101Found) {
        tft.setTextColor(TFT_GREEN, TFT_BLACK);
        tft.print("  >> CC1101 DETECTED");
    } else {
        tft.setTextColor(TFT_RED, TFT_BLACK);
        tft.print("  >> CC1101 NOT FOUND");
    }
    y += 18;

    // ── SD CARD TEST ────────────────────────────────────────────
    tft.setTextColor(TFT_CYAN, TFT_BLACK);
    tft.setCursor(5, y);
    tft.printf("SD Card: CS=%d", SD_CS);
    y += 12;

    SPI.end();
    delay(5);
    SPI.begin(VSPI_SCK, VSPI_MISO, VSPI_MOSI);
    pinMode(NRF24_CSN, OUTPUT);   digitalWrite(NRF24_CSN, HIGH);
    pinMode(CC1101_CS, OUTPUT);   digitalWrite(CC1101_CS, HIGH);

    // Send CMD0 (GO_IDLE) — card present returns 0x01
    digitalWrite(SD_CS, LOW);
    delayMicroseconds(5);
    for (int i = 0; i < 10; i++) SPI.transfer(0xFF);
    SPI.transfer(0x40);
    SPI.transfer(0x00);
    SPI.transfer(0x00);
    SPI.transfer(0x00);
    SPI.transfer(0x00);
    SPI.transfer(0x95);
    byte sdResp = SPI.transfer(0xFF);
    byte sdResp2 = SPI.transfer(0xFF);
    digitalWrite(SD_CS, HIGH);

    tft.setCursor(5, y);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.printf("  RESP: 0x%02X 0x%02X", sdResp, sdResp2);
    if (sdResp == 0x01) {
        tft.setTextColor(TFT_GREEN, TFT_BLACK);
        tft.print(" (card OK)");
    }
    y += 18;

    // ── SYSTEM INFO ─────────────────────────────────────────────
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setCursor(5, y);
    tft.printf("Heap:%d  CPU:%dMHz  Flash:%dMB",
        ESP.getFreeHeap(), ESP.getCpuFreqMHz(),
        ESP.getFlashChipSize() / 1024 / 1024);
    y += 12;

    uint64_t mac = ESP.getEfuseMac();
    tft.setCursor(5, y);
    tft.printf("MAC: %02X:%02X:%02X:%02X:%02X:%02X",
        (uint8_t)(mac), (uint8_t)(mac >> 8), (uint8_t)(mac >> 16),
        (uint8_t)(mac >> 24), (uint8_t)(mac >> 32), (uint8_t)(mac >> 40));
    y += 18;

    // ── COUNTDOWN ───────────────────────────────────────────────
    bool hasError = !nrfFound || !cc1101Found;
    int waitTime = hasError ? 8 : 3;

    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    for (int i = waitTime; i > 0; i--) {
        tft.fillRect(5, y, 230, 12, TFT_BLACK);
        tft.setCursor(5, y);
        if (hasError) {
            tft.printf("CHECK WIRING! Continuing in %d...", i);
        } else {
            tft.printf("All radios OK! Continuing in %d...", i);
        }
        delay(1000);
    }

    // Restore SPI bus to clean state for spiManager
    SPI.end();
    delay(5);
    SPI.begin(VSPI_SCK, VSPI_MISO, VSPI_MOSI);
    pinMode(SD_CS, OUTPUT);       digitalWrite(SD_CS, HIGH);
    pinMode(CC1101_CS, OUTPUT);   digitalWrite(CC1101_CS, HIGH);
    pinMode(NRF24_CSN, OUTPUT);   digitalWrite(NRF24_CSN, HIGH);
}

// ═══════════════════════════════════════════════════════════════════════════
// SETUP
// ═══════════════════════════════════════════════════════════════════════════

void setup() {
    // Initialize Serial
    Serial.begin(CYD_DEBUG_BAUD);
    delay(500);

