Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
#if defined(ESP32S3_ES3C28P) || defined(ESP32C5_NM_CYD)
    setCpuFrequencyMhz(240);
#endif

    Serial.println();
    Serial.println("===============================================");
    Serial.println("        " FW_DEVICE " " FW_VERSION);
    Serial.println("        " CYD_BOARD_NAME);
    Serial.println("===============================================");
    Serial.println();

    // Initialize display
    pinMode(CYD_TFT_BL, OUTPUT);
    digitalWrite(CYD_TFT_BL, HIGH);
    tft.init();
#if defined(ESP32S3_ES3C28P)
    tft.initDMA();
#endif
    tft.setRotation(0);  // Portrait mode — keeps 240x320 coordinate space
#if defined(ESP32S3_ES3C28P)
    tft.invertDisplay(true);   // ES3C28P IPS panel is easier on the eyes inverted
#elif defined(ESP32C5_NM_CYD)
    tft.invertDisplay(false);  // ST7789 reference setup uses inversion off
#elif defined(CYD_35)
    tft.invertDisplay(false);  // ST7796 panel has native inversion — OFF for correct colors
#else
    tft.invertDisplay(false);  // ILI9341 needs inversion OFF
#endif
    tft.fillScreen(WONTHOUND_BLACK);

    // Turn on backlight with PWM
    initBacklightPwm();
    setBacklightLevel((uint8_t)brightness_level);

    // Show splash screen
    showSplash();

    // Initialize subsystems
    Serial.println("[INIT] Initializing subsystems...");

    // SPI bus manager
    spiManagerSetup();
    Serial.println("[INIT] SPI Manager OK");

    // Touch buttons — init early so touch is ready before NRF24 check
    // XPT2046 uses software SPI (2.8") or shared HSPI (E32R35T) — neither conflicts with VSPI radios
    initButtons();
    Serial.println("[INIT] Touch buttons OK");

    // ═══════════════════════════════════════════════════════════════════════
    // WRONG FIRMWARE DETECTION — NRF24 SPI probe catches pin mismatches
    // Covers: CYD vs E32R28T (swapped CSN pins), CYD vs CYD-HAT, missing NRF24
    // ═══════════════════════════════════════════════════════════════════════
    {
        // Properly claim SPI for NRF24 check
        SPI.end();
        delay(10);
        pinMode(NRF24_CE, OUTPUT);
        digitalWrite(NRF24_CE, LOW);
        digitalWrite(NRF24_CSN, HIGH);
        digitalWrite(CC1101_CS, HIGH);
        digitalWrite(SD_CS, HIGH);
        digitalWrite(PN532_CS, HIGH);

        SPI.begin(VSPI_SCK, VSPI_MISO, VSPI_MOSI);
        delay(150);  // PA+LNA settling time

        // Reset SETUP_AW to default first — promiscuous sniffer leaves it at 0x00
        // NRF24 retains registers across ESP32 reset (no power cycle on USB)
        SPI.beginTransaction(SPISettings(4000000, MSBFIRST, SPI_MODE0));
        digitalWrite(NRF24_CSN, LOW);
        delayMicroseconds(5);
        SPI.transfer(0x20 | 0x03);  // Write register 0x03 (SETUP_AW)
        SPI.transfer(0x03);         // 5-byte address width (default)
        digitalWrite(NRF24_CSN, HIGH);
        delayMicroseconds(5);

        // Now read it back to verify NRF24 is responding
        digitalWrite(NRF24_CSN, LOW);
        delayMicroseconds(5);
        uint8_t nrfStatus = SPI.transfer(0x03);  // Read register 0x03
        uint8_t nrfSetupAw = SPI.transfer(0xFF);
        digitalWrite(NRF24_CSN, HIGH);
        SPI.endTransaction();

        bool nrfFound = (nrfSetupAw >= 0x01 && nrfSetupAw <= 0x03);
        Serial.printf("[INIT] NRF24 check: STATUS=0x%02X SETUP_AW=0x%02X → %s\n",
                      nrfStatus, nrfSetupAw, nrfFound ? "OK" : "NOT FOUND");

        // Clean up — restore SPI to spiManager state
        SPI.end();
        SPI.begin(VSPI_SCK, VSPI_MISO, VSPI_MOSI);
        digitalWrite(NRF24_CSN, HIGH);
        digitalWrite(CC1101_CS, HIGH);
        digitalWrite(SD_CS, HIGH);
        digitalWrite(PN532_CS, HIGH);

        if (!nrfFound) {
            // NRF24 not responding on compiled pin config — likely wrong firmware
            Serial.println("[INIT] WARNING: NRF24 not found on compiled pins!");
            Serial.printf("[INIT] Compiled for: %s (CE=%d, CSN=%d)\n", FW_DEVICE, NRF24_CE, NRF24_CSN);

#ifndef NRF24_BOOT_CHECK_OPTIONAL
            tft.fillScreen(TFT_BLACK);
            tft.drawRect(5, 5, SCREEN_WIDTH - 10, SCREEN_HEIGHT - 10, TFT_RED);
            tft.drawRect(7, 7, SCREEN_WIDTH - 14, SCREEN_HEIGHT - 14, TFT_RED);

            drawGlitchTitle(60, "WARNING");

            tft.setTextSize(1);
            drawCenteredText(85, "NRF24 NOT DETECTED", TFT_RED, 1);
            drawCenteredText(100, "Wrong firmware for this board?", WONTHOUND_MAGENTA, 1);

            tft.setTextColor(WONTHOUND_MAGENTA, TFT_BLACK);
            tft.setCursor(15, 120);
            tft.printf("Flashed: %s", FW_EDITION);
            tft.setCursor(15, 135);
            tft.printf("NRF24 pins: CE=%d CSN=%d", NRF24_CE, NRF24_CSN);

            drawCenteredText(160, "Flash the correct binary:", WONTHOUND_HOTPINK, 1);

            #ifdef NMRF_HAT
            drawCenteredText(180, "WontHound-CYD.bin", WONTHOUND_BRIGHT, 1);
            drawCenteredText(195, "(standard CYD without hat)", WONTHOUND_MAGENTA, 1);
            #elif defined(CYD_E32R28T)
            drawCenteredText(180, "WontHound-CYD.bin", WONTHOUND_BRIGHT, 1);
            drawCenteredText(195, "(if you have a standard CYD)", WONTHOUND_MAGENTA, 1);
            #else
            drawCenteredText(180, "WontHound-E32R28T.bin", WONTHOUND_BRIGHT, 1);
            drawCenteredText(195, "(if you have a QDtech E32R28T)", WONTHOUND_MAGENTA, 1);
            drawCenteredText(215, "WontHound-CYD-HAT.bin", WONTHOUND_BRIGHT, 1);
            drawCenteredText(230, "(if you have the NM-RF-Hat)", WONTHOUND_MAGENTA, 1);
            #endif

            drawCenteredText(255, "Or: no NRF24 wired yet", WONTHOUND_GUNMETAL, 1);
            drawCenteredText(275, "Touch screen to continue", WONTHOUND_GUNMETAL, 1);

            // Wait for touch to continue — don't brick the device, just warn
            while (true) {
                uint16_t wx, wy;
                if (getTouchPoint(&wx, &wy)) break;
                if (Serial.available()) break;
                delay(50);
            }
            // Brief debounce
            delay(300);

            // Re-show splash and continue boot
            showSplash();
#else
            Serial.println("[INIT] NRF24 boot check is optional for this build; continuing.");
#endif
        }
    }

    // Boot diagnostics disabled for normal boot — function kept for second board debugging
    // runBootDiagnostics();

    // Touch test available via runTouchTest() if needed for recalibration

    // Load settings from EEPROM (brightness, timeout, color order, rotation, touch cal, color mode, PIN)
    loadSettings();
    disclaimer_accepted = true;
    pin_enabled = false;
    device_locked = false;
    device_pin = 0;

    setBacklightLevel((uint8_t)brightness_level);
    applyColorMode(color_mode);

    // Apply saved rotation — must happen before applyColorOrder (which needs correct MADCTL base)
    if (screen_rotation != 0) {
        tft.setRotation(screen_rotation);
        Serial.printf("[INIT] Rotation set to %d\n", screen_rotation);
    }
    applyColorOrder();
    tft.invertDisplay(display_inverted);
    Serial.println("[INIT] Settings loaded");

