Wontfallo/Wonthound/ESP32-C5-2.8-WIP/WontHound-CYD.ino
#if defined(ESP32S3_ES3C28P) || defined(ESP32C5_NM_CYD)
    Serial.printf("[INIT] PSRAM: %s, free=%u total=%u\n",
                  psramFound() ? "OK" : "missing",
                  ESP.getFreePsram(),
                  ESP.getPsramSize());
    if (storageBegin()) {
        Serial.printf("[INIT] Storage: %s, size=%llu MB\n",
                      storageBackendName(),
                      (unsigned long long)(SD.cardSize() / (1024ULL * 1024ULL)));
    } else {
        Serial.printf("[INIT] Storage: %s not mounted\n", storageBackendName());
    }
#if WONTHOUND_HAS_WIFI_5G
    wh_wifi_print_c5_runtime_report();
#endif
#if CYD_HAS_AUDIO
    if (s3AudioBegin()) {
        Serial.println("[INIT] Audio codec/mic OK");
    } else {
        Serial.println("[INIT] Audio codec/mic not ready");
    }
#endif
#endif

    // E32R28T: Shut down SC8002B amp immediately (GPIO 4 = amp enable)
    // Must happen BEFORE PA init — prevents 6.5mA quiescent draw from floating pin
    #if CYD_HAS_AMP
    pinMode(CC1101_TX_EN, OUTPUT);
    digitalWrite(CC1101_TX_EN, LOW);   // LOW = amp shutdown
    Serial.println("[INIT] E32R28T SC8002B amp shut down (GPIO 4 LOW)");
    #endif

    // Initialize CC1101 PA pins if E07 module enabled
    #if defined(CC1101_TX_EN) && defined(CC1101_RX_EN)
    if (cc1101_pa_module) {
        pinMode(CC1101_TX_EN, OUTPUT);
        pinMode(CC1101_RX_EN, OUTPUT);
        digitalWrite(CC1101_TX_EN, LOW);
        digitalWrite(CC1101_RX_EN, HIGH);  // RX mode default — keeps GPIO0 HIGH (BOOT safe)
        Serial.println("[INIT] CC1101 PA module — TX_EN/RX_EN pins initialized (RX mode)");
    }
    #endif

    // Auto-trigger touch calibration on first boot (uncalibrated board)
    {
        extern bool touch_calibrated;
#if defined(ESP32C5_NM_CYD) && !C5_FORCE_TOUCH_CALIBRATION_ON_BOOT
        if (!touch_calibrated) {
            Serial.println("[INIT] No touch calibration found — using defaults; Settings > Touch Calibration remains available");
        }
#else
        if (!touch_calibrated) {
            Serial.println("[INIT] No touch calibration found — running first-time calibration");
            runTouchCalibration();
        }
#endif
    }

    // Initialize battery monitor (ADC on GPIO 34)
    #if CYD_HAS_BATTERY
    batteryInit();
    Serial.println("[INIT] Battery monitor OK");
    #endif

    // Print system info
    Serial.printf("[INFO] Free Heap: %d\n", ESP.getFreeHeap());
    Serial.printf("[INFO] CPU Freq: %d MHz\n", ESP.getCpuFreqMHz());
    Serial.printf("[INFO] Flash Size: %d MB\n", ESP.getFlashChipSize() / 1024 / 1024);

    // Small delay to show splash
    delay(2000);

    // Show main menu
    is_main_menu = true;
    menu_initialized = false;
    displayMenu();
    last_interaction_time = millis();

    Serial.println("[INIT] Setup complete - entering main loop");
}

// ═══════════════════════════════════════════════════════════════════════════
// MAIN LOOP
// ═══════════════════════════════════════════════════════════════════════════

void loop() {
    #if CYD_HAS_BATTERY
    batteryUpdate();
    #endif
    handleButtons();
    delay(20);
}
